[
  {
    "id": 4,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "The World's going full degen, be better",
    "content": "Platforms like Polymarket are exploding in hype, where you can bet on elections, weather, and even celebrity divorcesSome analysts suggest the reason there was no real altcoin season this bull run is because so much money was diverted into these gambling platforms\n    \n      Meanwhile, the crypto space has been taken over by memecoins that rug at the slightest profit.From Argentina’s president to that 13-year-old kid, everyone seems to be trying to make a quick buckIt’s peak degeneracy\n    \n      And that’s exactly why RAWW stands out\n    \n      RAWW isn’t built around the degen/casino mindsetIt leans in the opposite direction, the natural-living, anti-degen movement that’s exploding outside of crypto\n    \n      People are tired of everything synthetic, tired of dopamine traps, tired of projects designed just to pump and dump.\n    \n      RAWW taps into that shift with a meme that actually has a foundation:\n    \n      • An ASMR clicker game live• weekly webtoon chapters• A RAWW Album ( 13 songs )• 100% natural merch• an IRL narrative with real personality and voice (the RAWW Milk Man)• and a community that builds instead of gambles• The RAWW truth series ( launching very soon )\n    \n      While everyone else is pushing degeneracy, RAWW is pushing back.\n    \n      It’s not the loudest coin or the flashiest, but it’s one of the few doing something different, and doing it consistently.\n    \n      If you want off the degen treadmill, RAWW is one of the only memes this cycle that isn’t built on pure luck, hype or dopamine.\n    \n      Be DifferentBe RealBe RAWW\n    \n      Mcap: 130k\n    \n      CA: 8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5pLinktree: https://linktr.ee/RAWWMilkCryptoCMC:https://dex.coinmarketcap.com/token/solana/8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5p/",
    "author": "u/Ok_Poem_2813",
    "timestamp": "2025-11-15T18:55:00.254000+0000",
    "post_age": "8 hr. ago",
    "upvotes_likes": 10,
    "comment_count": 4,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "Building an actual brand, not just a token. $RAWW",
      "natural living narrative is only getting bigger. glad I found this early. $RAWW",
      "Yeah, it’s getting more and more popular every day"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxzpg9/the_worlds_going_full_degen_be_better/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "RAWW"
  },
  {
    "id": 5,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Anyone grinding small caps on Tron?",
    "content": "I've been scouting micro-cap gems on the Tron network lately, the kind with market caps under 10M that can explode if some real volume rolls in. You get it - those degenerate plays where timing is everything, but fees kill the vibe. Every swap, transfer, or contract call drains energy like crazy, and if I stake a ton of TRX to build up resources, that's capital stuck that I could use for jumping into more positions. It's frustrating when you're trying to flip quick without bleeding out on costs.\n    \n      Last week, I got fed up and tested renting energy from tr.energy. Super straightforward: punch in your wallet address, choose a rental period - I went with 24 hours to keep it short - drop a handful of TRX as payment, and boom, the energy shows up in your account in less than a minute. No hassle, no waiting around. I ran a bunch of USDT transfers for three different token flips that day, and it cut my costs by around 60% compared to burning energy outright. Best part? Zero KYC nonsense, no locking up your funds long-term, and it doesn't mess with anything on-chain - just a quick boost to your resources so you can trade freely.\n    \n      It's a game-saver for low-volume stuff where you don't want to commit big. Before this, I'd burn through extra TRX or skip trades altogether. Now, I can hit those sketchy micro-caps without second-guessing fees. You guys rent energy like this for your degen hunts, or do you have other tricks? What's your go-to hack for dodging fees on those high-risk, low-MC coins? Share if you've got something better - curious if there's a free option or something I missed",
    "author": "u/Busternookiedude",
    "timestamp": "2025-11-15T18:32:37.017000+0000",
    "post_age": "9 hr. ago",
    "upvotes_likes": 1,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxz577/anyone_grinding_small_caps_on_tron/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "TRX"
  },
  {
    "id": 6,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Microsoft + Google Supported Project on Solana… Potential Sleeper?",
    "content": "I hadn’t heard much about Biokript Pro until recently, but it’s suddenly showing up everywhere. After digging into it, it actually looks like one of the more serious builds happening on Solana right now. It positions itself as the first patented hybrid DEX on Solana, focused on trader protection, automated execution tools, and long-term value sharing rather than hype.\n    \n      Here are the standout points: • Patented Rug-Pull Protection: Built-in logic that helps prevent malicious liquidity drains, addressing one of the biggest risks in DeFi. • First On-Chain Stop-Loss on Solana: Traders can set automated stop-losses while keeping full control of their wallet. No other Solana DEX offers true on-chain stop-loss execution. • Profit Sharing for Holders: 50 percent of all trading fees are distributed to BIOK token holders, treating the community as true partners. • Microsoft + Google Cloud Support: The team secured verified support from both, including over $100K in combined resources for scaling, infrastructure, and performance. I had verified this on the telegram group. • Ultra-Low 0.1 Percent Fee: 10X lower than most competitors like Axiom, making it more attractive for real trading volume. • Hybrid Execution Architecture: Combines decentralized control with CEX-level speed, automation, and rug pull protection.\n    \n      With Solana’s surge of new DEXs, many are just clones or basic routers. Biokript Pro is actually trying to solve real trading pain points like safety, automation, and fair value alignment. If they deliver everything they’ve outlined, this might end up being one of the more meaningful utility platforms going into the next altseason.\n    \n      Their presale on Pinksale ends on November 17 at 19:00 UTC, so it will be interesting to see how things unfold as they move toward launch.\n    \n      Anyone else following this? Would love to hear thoughts from traders who have been waiting for proper onchain stop loss and safer execution tools. https://biokript.com",
    "author": "u/SeriousExamination49",
    "timestamp": "2025-11-15T15:27:27.559000+0000",
    "post_age": "12 hr. ago",
    "upvotes_likes": 0,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "“Hadn’t heard much about”, except via your daily shills."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxugoj/microsoft_google_supported_project_on_solana/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "BIOK"
  },
  {
    "id": 66,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "$VOOZ: You will meet the hardest mfs on Vooz!",
    "content": "Getting bored? Just get on Vooz. I swear Vooz is the most fun platform you will ever see. You get to meet all kinda people here, from any race, region, age. You want people from your region? Alright, buy some Vooz token and get location filters with it. You wanna match with the opposite gender? Cool, we got you. Get some gender filter with your Vooz tokens. We got your back!\n    \n      What if I dont wanna video chat, and just wanna text chat? We got your back again. You can match with any user and text chat with them. If you want group text chats, you can join any global chatroom and chill with like minded peeps. You want group video chats? We got hangout. Hangout isn't released yet and will be released in the coming weeks. Anyone can create a hangout and as an organiser, he/she can decide whether to keep the video on or off. Others will be able to see the hangout and join if interested. Basically a big video chatroom.\n    \n      Also if you are not into Web3 and do not hold any Vooz token, you can pay for premium features through fiat, but the fiat price will be higher than if paid through the token. Also check out our merchandise which ships globally.\n    \n      vooz4rKUS7PJ2a1r1T3q81E7b5NpGYjsT5YxciCJ4rF",
    "author": "u/Early-Biscotti-6100",
    "timestamp": "2025-10-19T13:53:08.864000+0000",
    "post_age": "28 days ago",
    "upvotes_likes": 5,
    "comment_count": 8,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oaq7eg/vooz_you_will_meet_the_hardest_mfs_on_vooz/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 67,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Baumz raises $500K to reshape perpetual trading — focusing on fairness, speed, and transparency",
    "content": "Hey everyone,\n    \n      I wanted to share an interesting update from the DeFi derivatives space. Baumz, a decentralized perpetual trading protocol, has recently closed a $500K angel round to accelerate the launch of its new Baumz Pro platform — an on-chain trading system that aims to combine CEX-level performance with DeFi transparency.\n    \n      What makes Baumz different:\n    \n        \n      \n      Instead of charging fees on every trade, Baumz uses something called the Pop-Net+ Carry model — traders only pay fees if their 24-hour average profit is positive.\n    \n    \n      \n      The protocol introduces a Tri-Proof Oracle (TPO) system to prevent false liquidations by verifying data freshness, deviation, and sanity across multiple oracles.\n    \n    \n      \n      Supports up to 1024× leverage with a matching engine targeting ≤10 ms latency and 250k TPS.\n    \n    \n      \n      Includes RWA perpetuals such as S&P 500 and Nasdaq 100, bringing traditional assets into the crypto derivatives ecosystem.\n    \n    \n      \n      The raise comes at an interesting time: DEXs are quickly closing the gap with centralized exchanges in speed, UI, and execution quality. Baumz seems to be positioning itself as a bridge between both worlds — performance-driven yet non-custodial.\n    \n      According to the team, the funds will be used to finalize audits, expand trading pairs, and roll out “Season 0” and “Season 1” reward campaigns for early traders.\n    \n      \n    \n      Baumz Basic is already live on multiple chains (with up to 50× leverage), while Baumz Pro is scheduled for Q1 2026.\n    \n      Full details and documentation are available here:🌐 https://docs.baumz.comX: https://x.com/Baumztrade\n    \n      Do you think models like “profit-based fees” and “multi-proof oracles” can make DEX perps finally competitive with CEX platforms like Binance Futures or OKX Perps?\n    \n      Would you trust a DEX with 1024× leverage if it offered transparent on-chain risk management?",
    "author": "u/HenriettaPinard",
    "timestamp": "2025-10-19T07:54:00.900000+0000",
    "post_age": "28 days ago",
    "upvotes_likes": 1,
    "comment_count": 3,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oajvip/baumz_raises_500k_to_reshape_perpetual_trading/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "500K"
  },
  {
    "id": 71,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Just another day for $OBEY! Another community joined us!",
    "content": "As the days pass by, The Void continues to Grow! Another community has decided to $OBEY\n    \n      There are now 4 different living communities under the Void, and they are:\n    \n      Pasta, which is known for its cult-rewarding system called Legion Smallpipi, which is known for the Volume Booster they built Plath, which is known for its charity-driven purposes Lil Pods, which is known for its Gaming community and the drive for developing NFTs and Web3 Video Games\n    \n      All utilities will remain under one umbrella, which is $OBEY, and we will continue to build more, as we are now backed up with more coders and artists, not to mention the community that will push this one!\n    \n      If your project is currently struggling, this will be the perfect time for you to check us out and possibly join us! What's in store for you?\n    \n      You get to maintain your identity as a community, so there is nothing to worry about totally changing your art and everything! More utilities will come for your project and the collectors (DEVs or Leaders of your community) will receive a revenue share from our token! Token Bonus is a possibility which will be swapped 1:1 of the value of your current tokens right now not to mention that you can also receive some bonus for it!\n    \n      The Presale is live and going well right now, and you an get them for a really cheap price! 60 SOL has now been collected and our marketing efforts will just continue to grow and be more aggressive as the days passes by!\n    \n      If you want to be part of something early join us now! $OBEY the Void and you will be rewarded!\n    \n      TG & X: @ObeyTheVoid",
    "author": "u/Juggernaut98503",
    "timestamp": "2025-10-19T01:06:38.225000+0000",
    "post_age": "28 days ago",
    "upvotes_likes": 13,
    "comment_count": 17,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oacq4g/just_another_day_for_obey_another_community/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "OBEY"
  },
  {
    "id": 79,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Where Communities Merge — $OBEY Rises",
    "content": "$OBEY is not wrought by mortal hands. It is the shape mankind believes their souls assume when they yield at last, a heavy token of surrender, cold and true. This coin is the Void’s will made tangible.\n    \n      After months of preparation, $OBEY unites powerful communities like Smallpipi, Pasta, and Plath under one banner. In this bull run, strength comes from unity. If your project struggles or faces setbacks, join us. Keep your identity, but gain the strength of a larger family ready to moon together.\n    \n      Qualified projects receive a 1:1 token swap plus bonus $OBEY tokens and access to exclusive utilities built by talented developers.\n    \n      The Void calls. The Pre-sale is open.\n    \n      Answer us! The Void hungers. Feed it and be rewarded.\n    \n       What’s coming:• A Merge dApp that lets smaller coins join and grow inside The Void.• A Cult System where you build your own group, gain power, and earn $OBEY.• A Trading Card Game on Telegram where you battle and win $OBEY.• A Charity dApp keeping the spirit of one of the merged projects alive.• And more things already rising from the dark.",
    "author": "u/MadHenk",
    "timestamp": "2025-10-17T12:50:51.468000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 10,
    "comment_count": 8,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o90fuj/where_communities_merge_obey_rises/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "OBEY"
  },
  {
    "id": 83,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "$ALEIN - UFO Still Orbiting | P2E launch in November",
    "content": "Hey fam,\n    \n      The ALEIN Ascension Protocol is still making noise in the Gamefi space as we get closer to the November P2E Launch. It's a simple arcade for now but it's a way to earn crypto while actually doing something enjoyable. Every transaction funds the project through either liquidity or marketing funds so we continually grow. We're small now but we haven't begun our first marketing push yet, that will coincide with our P2E release.\n    \n      Of course in order to participate in our P2E and earn tokens, you will need to be a holder. We're thinking of a number and it should be around 50,000 tokens which is super cheap right now but won't be when you reap the P2E rewards. We plan to evolve into so much more than this small arcade. With growth comes a growing ecosystem, new developers added to the team, new heights we could reach. You're early in a growing developing project that is so small it could make you very rich. This is just the beginning of something much bigger.\n    \n      Doxxed, locked and safe to ape, come join the $ALEIN Ascension Protocol. Follow all dev updates and see all plans for the Protocol at https://alein.info",
    "author": "u/thetazzfalcon",
    "timestamp": "2025-10-17T03:34:57.691000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o8qv6n/alein_ufo_still_orbiting_p2e_launch_in_november/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "ALEIN"
  },
  {
    "id": 1,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$MERL Is Showing Strength Amid Market Volatility, But What Could Be Next for Its Move?",
    "content": "$MERL rose 2.44% in the last 24 hours, moving ahead of the broader crypto market. I’ve been watching it after the recent volatility and it started showing some signs of stabilization. Network upgrades, new exchange support, and a short-term technical rebound all seemed to line up, but seeing it move in real time feels different from just reading charts.\n    \n      I decided to trade it on Bitget as part of the Trading Club Championship Phase 17. I’m not chasing anything, just following $MERL, making small moves, and seeing how it behaves. The extra BGB from the challenge is just part of the process, not the reason I’m trading, mostly it’s about watching how it flows in the market.\n    \n      It makes you wonder if setups like this can appear quietly, what else might be forming in the background that most people aren’t noticing?\n    \n      https://coinmarketcap.com/currencies/merlin-chain",
    "author": "u/Feisty-Rhubarb-6718",
    "timestamp": "2025-11-15T23:24:35.967000+0000",
    "post_age": "4 hr. ago",
    "upvotes_likes": 2,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1oy64hv/merl_is_showing_strength_amid_market_volatility/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "MERL"
  },
  {
    "id": 2,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "The World's going full degen, be better",
    "content": "Platforms like Polymarket are exploding in hype, where you can bet on elections, weather, and even celebrity divorcesSome analysts suggest the reason there was no real altcoin season this bull run is because so much money was diverted into these gambling platforms\n    \n      Meanwhile, the crypto space has been taken over by memecoins that rug at the slightest profit.From Argentina’s president to that 13-year-old kid, everyone seems to be trying to make a quick buckIt’s peak degeneracy\n    \n      And that’s exactly why RAWW stands out\n    \n      RAWW isn’t built around the degen/casino mindsetIt leans in the opposite direction, the natural-living, anti-degen movement that’s exploding outside of crypto\n    \n      People are tired of everything synthetic, tired of dopamine traps, tired of projects designed just to pump and dump.\n    \n      RAWW taps into that shift with a meme that actually has a foundation:\n    \n      • An ASMR clicker game live• weekly webtoon chapters• A RAWW Album ( 13 songs )• 100% natural merch• an IRL narrative with real personality and voice (the RAWW Milk Man)• and a community that builds instead of gambles• The RAWW truth series ( launching very soon )\n    \n      While everyone else is pushing degeneracy, RAWW is pushing back.\n    \n      It’s not the loudest coin or the flashiest, but it’s one of the few doing something different, and doing it consistently.\n    \n      If you want off the degen treadmill, RAWW is one of the only memes this cycle that isn’t built on pure luck, hype or dopamine.\n    \n      Be DifferentBe RealBe RAWW\n    \n      Mcap: 130k\n    \n      CA: 8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5pLinktree: https://linktr.ee/RAWWMilkCryptoCMC:https://dex.coinmarketcap.com/token/solana/8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5p/",
    "author": "u/Ok_Poem_2813",
    "timestamp": "2025-11-15T18:55:03.703000+0000",
    "post_age": "8 hr. ago",
    "upvotes_likes": 12,
    "comment_count": 6,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1oxzpi8/the_worlds_going_full_degen_be_better/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "RAWW"
  },
  {
    "id": 10,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Fed cut rates, are you buying more $VOOZ anon?",
    "content": "",
    "author": "u/[deleted]",
    "timestamp": "2025-09-20T18:02:02.359000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 3,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1nm51b3/fed_cut_rates_are_you_buying_more_vooz_anon/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 11,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Aster ($ASTER) a project I think has some serious potential. If you like risk & upside, this might be one to dig into",
    "content": "What is Aster?\n      Here’s what I found from CoinMarketCap and Aster’s docs:\n    \n        \n      \n      Aster is a next-gen decentralized exchange with both Spot and Perpetual trading. It aims to be an on-chain hub for global crypto traders. (CoinMarketCap)\n    \n    \n      \n      It supports “Simple Mode” for one-click, MEV-free execution, and “Pro Mode” with features like hidden orders, grid trading, and 24/7 stock perpetuals. (CoinMarketCap)\n    \n    \n      \n      Allows using liquid staking tokens (e.g. asBNB) or yield-generating stablecoins (USDF) as collateral. Good for capital efficiency. (CoinMarketCap)\n    \n    \n      \n      Built on “Aster Chain”, a high-performance, privacy-focused Layer 1. The project is backed by YZi Labs. (CoinMarketCap)\n    \n    \n      Key Stats\n        \n      \n      Price: ~$1.35 USD (volatile, seems like it’s had a big move recently) (CoinMarketCap)\n    \n    \n      \n      Market Cap: ~$2.24B (CoinMarketCap)\n    \n    \n      \n      Circulating Supply: ~1.65B ASTER of 8B total (CoinMarketCap)\n    \n    \n      \n      24h Volume: High—around $1.2B — shows there’s real trading activity. (CoinMarketCap)\n    \n    \n      What I Like — Upside Potential\n        \n      \n      The mix of DEX + Perp + cross-chain support (BNB Chain, Ethereum, Solana, Arbitrum) gives it flexibility and access to big liquidity pools.\n    \n    \n      \n      Using yield/staking / stablecoin collateral adds utility beyond just trading. That kind of capital efficiency can attract sophisticated traders.\n    \n    \n      \n      The upside if the simple & pro modes attract large volumes, plus if the chain’s performance and privacy features are solid.\n    \n    \n      Risks / What to Watch Out For\n        \n      \n      It’s still early: L1 chains are tough to launch and maintain. Network stability, security, adoption, and competition matter.\n    \n    \n      \n      Regulatory risk: Perpetuals & derivatives are often under higher regulatory scrutiny.\n    \n    \n      \n      Competition is stiff: Many projects are doing DEX + perp trading + multi-chain. Aster needs to differentiate well and deliver.\n    \n    \n      \n      Tokenomics and unlock schedule / dilution risk—whenever supply is large (8B max) you need to see how tokens are released.\n    \n    \n      My Take\n      I see ASTER being a promising Moonshot. If they execute well, especially on adoption of both spot & perp over multiple chains, there’s likely significant upside. Personally I’m considering a small position to ride the potential, but only after I double-check token unlocks & roadmap delivery.\n    \n      If you want to check it out, here’s my invite link (we both get rewards if you join via this):https://www.asterdex.com/en/referral/47Gc3iInvite code: 47Gc3i",
    "author": "u/WarriorNysty",
    "timestamp": "2025-09-20T18:01:07.491000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1nm50g0/aster_aster_a_project_i_think_has_some_serious/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "ASTER"
  },
  {
    "id": 13,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$DOG on BITCOIN",
    "content": "$DOG (Bitcoin meme coin) Has Upside Potential\n    \n      Here are some reasons people are excited about $DOG, the meme coin built on the Bitcoin blockchain (Runes Protocol):\n    \n      ⸻\n    \n        \n      \n      Bitcoin Security & Brand\n    \n    \n      \n      Since it lives on Bitcoin, $DOG benefits from the most secure and decentralized blockchain. That sets it apart from most other meme coins.\n    \n      2. Fair Launch & Community First •\tNo premine •\tNo team allocation •\t100% airdropped to the community This gives $DOG strong grassroots support and avoids the classic “dev dump” issue.\n    \n      3. Fixed Supply (100B)\n    \n      Everyone knows the total supply upfront. No hidden inflation, no surprises.\n    \n      4. Growing Interest\n    \n      Some institutions and public companies have already started accumulating, which helps with legitimacy and liquidity.\n    \n      5. Tied to Bitcoin’s Momentum\n    \n      When Bitcoin does well, $DOG can ride the wave since it’s Bitcoin-native. Strong BTC = more attention on $DOG.\n    \n      6. Meme Power + Community Hype\n    \n      Like all meme coins, community + virality matter. $DOG is already picking up speed as “the Dogecoin of Bitcoin.”\n    \n      7. Accessible Speculation\n    \n      It’s cheap enough for small investors to grab a bag and hope for outsized gains — the same recipe that has fueled other meme runs.\n    \n      8. Different From the Rest\n    \n      Most meme coins live on Ethereum or Solana. $DOG is Bitcoin-native, which gives it a unique narrative in a crowded market.\n    \n      ⸻\n    \n      TL;DR: $DOG = Meme coin + Bitcoin security + Fair launch + Strong community + Fixed supply. Not financial advice, but the upside case is clear.\n    \n      Major community on X\n    \n      https://coinmarketcap.com/currencies/dog-go-to-the-moon-rune/",
    "author": "u/Careless-Welder6143",
    "timestamp": "2025-09-20T07:50:37.779000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 2,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1nls60x/dog_on_bitcoin/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "DOG"
  },
  {
    "id": 15,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Why $VOOZ is one of the most genuine memecoins on Solana",
    "content": "",
    "author": "u/[deleted]",
    "timestamp": "2025-09-19T16:49:08.608000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1nl8tah/why_vooz_is_one_of_the_most_genuine_memecoins_on/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 21,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "What it takes to impress a $VOOZ girlie 😂",
    "content": "",
    "author": "u/[deleted]",
    "timestamp": "2025-09-19T08:23:31.954000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 17,
    "comment_count": 17,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1nkxx9o/what_it_takes_to_impress_a_vooz_girlie/",
    "post_type": "video",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 26,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$DOG a BITCOIN memecoin",
    "content": "$DOG (Bitcoin meme coin) Has Upside Potential 🐕🚀\n    \n      Here are some reasons people are excited about $DOG, the meme coin built on the Bitcoin blockchain (Runes Protocol):\n    \n      ⸻\n    \n      🔒 1. Bitcoin Security & Brand\n    \n      Since it lives on Bitcoin, $DOG benefits from the most secure and decentralized blockchain. That sets it apart from most other meme coins.\n    \n      🤝 2. Fair Launch & Community First •\tNo premine •\tNo team allocation •\t100% airdropped to the community This gives $DOG strong grassroots support and avoids the classic “dev dump” issue.\n    \n      📉 3. Fixed Supply (100B)\n    \n      Everyone knows the total supply upfront. No hidden inflation, no surprises.\n    \n      🏦 4. Growing Interest\n    \n      Some institutions and public companies have already started accumulating, which helps with legitimacy and liquidity.\n    \n      📈 5. Tied to Bitcoin’s Momentum\n    \n      When Bitcoin does well, $DOG can ride the wave since it’s Bitcoin-native. Strong BTC = more attention on $DOG.\n    \n      😂 6. Meme Power + Community Hype\n    \n      Like all meme coins, community + virality matter. $DOG is already picking up speed as “the Dogecoin of Bitcoin.”\n    \n      💰 7. Accessible Speculation\n    \n      It’s cheap enough for small investors to grab a bag and hope for outsized gains — the same recipe that has fueled other meme runs.\n    \n      🐕 8. Different From the Rest\n    \n      Most meme coins live on Ethereum or Solana. $DOG is Bitcoin-native, which gives it a unique narrative in a crowded market.\n    \n      ⸻\n    \n      TL;DR: $DOG = Meme coin + Bitcoin security + Fair launch + Strong community + Fixed supply. Not financial advice, but the upside case is clear.\n    \n      https://coinmarketcap.com/currencies/dog-go-to-the-moon-rune/",
    "author": "u/Careless-Welder6143",
    "timestamp": "2025-09-18T19:21:33.766000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 2,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1nkhn40/dog_a_bitcoin_memecoin/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "DOG"
  },
  {
    "id": 33,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "How Do Tokens Like $AVNT Perform After a Big Exchange Listing?",
    "content": "One of the most interesting things to watch in crypto is how a token reacts when it gets listed on a major exchange. It is almost like a stress test for the project. Suddenly, liquidity improves, more traders can access it, and the spotlight gets a little brighter.\n    \n      Usually, the first thing you will see is a spike in price and volume. A lot of that is just hype, new eyes jump in, and early holders sometimes use the liquidity to take profits. After that initial wave, tokens often settle down and find a new real market value. In some cases, that value holds higher than before because of the increased exposure, while in other cases the hype fades quickly.\n    \n      Recently, $AVNT which was listed on Bitget like many tokens, it had that initial pop when trading opened, and then traders started testing the waters to see where the fair price should be. It is a reminder that exchange listings do not automatically mean long term growth, but they do matter for accessibility and legitimacy.\n    \n      For long term holders, listings are more about trust and network effects. A token that is available on a big exchange is easier to trade, easier to follow, and often taken more seriously by the broader market. For short term traders, it is usually about riding the volatility and volume that comes with the news.\n    \n       When you see a token get listed on a major exchange, do you treat it as a trading opportunity, a long term signal, or just hype to be cautious about?\n    \n       https://coinmarketcap.com/currencies/avantis/",
    "author": "u/Then_Helicopter4243",
    "timestamp": "2025-09-17T22:43:15.929000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1njrnws/how_do_tokens_like_avnt_perform_after_a_big/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "AVNT"
  },
  {
    "id": 85,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "BNB ecosystem quietly leaning into AI, $GATA is an interesting case",
    "content": "Everyone’s talking about ETH and Solana, but they tend to forget that every cycle, there’s a narrative that sneaks up before it goes mainstream. Lately I’ve noticed how much the BNB ecosystem has been evolving beyond the usual DeFi and meme plays. A lot of their incubation projects are quietly AI-focused, and that caught my attention.\n    \n      From Chaingpt ($CGPT) to MYshell ($SHELL) and now Gata ($GATA). The core idea is a decentralized marketplace for AI training data + compute. Instead of relying on centralized players, they’re trying to crowdsource resources and turn them into something like a distributed AI supercomputer. Their DataAgent, which evaluates the quality of datasets, feels like a practical step forward given how much junk data exists online.\n    \n      It also doesn’t hurt that they’re backed by YZi Labs (ex-Binance Labs). The timing is interesting too since $GATA just listed on exchanges like Bitget and others, which has been hosting a streak of AI and utility-heavy tokens lately. What I find compelling is that this isn’t just a trading narrative, it’s tied to real infrastructure needs in AI.\n    \n      Still, early days. I’d love to hear how others here think about AI x crypto beyond the hype and How do we see BNB resurfacing again\n    \n      https://coinmarketcap.com/currencies/gata/",
    "author": "u/Bitter-Entrance1126",
    "timestamp": "2025-09-04T12:58:05.675000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 3,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n89fd1/bnb_ecosystem_quietly_leaning_into_ai_gata_is_an/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "GATA"
  },
  {
    "id": 90,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Portal to Bitcoin ($PTB) recently got listed on multiple major exchanges",
    "content": "Portal to Bitcoin ($PTB) has been gaining traction lately as it positions itself as a project bridging the Bitcoin ecosystem with broader DeFi applications. Its recent listings, including Bitget, make it more accessible to traders exploring BTC-adjacent plays.\n    \n      For those curious:CMC link: https://coinmarketcap.com/currencies/portaltobitcoin/\n    \n      Not financial advice, just sharing since it seems like an interesting addition to the altcoin landscape.",
    "author": "u/Intelligent_Way_9450",
    "timestamp": "2025-09-03T13:50:06.429000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 2,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n7fcp7/portal_to_bitcoin_ptb_recently_got_listed_on/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "PTB"
  },
  {
    "id": 93,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$VOOZ: Why memecoins should have some utility!",
    "content": "",
    "author": "u/knowinglyunknown_7",
    "timestamp": "2025-09-02T18:09:13.483000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n6qwua/vooz_why_memecoins_should_have_some_utility/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 100,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Unban yourself on Vooz through $VOOZ!",
    "content": "",
    "author": "u/knowinglyunknown_7",
    "timestamp": "2025-09-02T06:19:41.958000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n6c127/unban_yourself_on_vooz_through_vooz/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 106,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Get Vooz Premium at a 50% discount through $VOOZ",
    "content": "",
    "author": "u/dhirumamta69",
    "timestamp": "2025-08-31T12:27:16.371000+0000",
    "post_age": "3 mo. ago",
    "upvotes_likes": 0,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n4tee8/get_vooz_premium_at_a_50_discount_through_vooz/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 109,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$VOOZ monetization is live, goodbye Omegle!!",
    "content": "",
    "author": "u/alternative_lead2",
    "timestamp": "2025-08-30T12:42:35.003000+0000",
    "post_age": "3 mo. ago",
    "upvotes_likes": 4,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n40oar/vooz_monetization_is_live_goodbye_omegle/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 7,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "Today I finally understood how tokens actually work",
    "content": "“Today was a big learning day for me. I spent hours researching how tokens actually work behind the scenes — not the hype part, the real mechanics.\n    \n      Here’s what I understood:\n    \n      🔹 Market Cap = Price × Total Supply This decides how big a coin really is. A coin isn’t “cheap” just because the price is low — the supply matters more.\n    \n      🔹 Liquidity is the lifeline of a coin If a coin has low liquidity, people can’t buy or sell easily. It becomes unstable. Good projects always have strong liquidity pools.\n    \n      🔹 Token Supply is a strategic decision Should it be:\n    \n      1 billion?\n    \n      1 trillion?\n    \n      420 million? 😆 Supply affects price psychology and community interest.\n    \n      🔹 Launch platforms matter SOL, ETH, BNB — each blockchain has different fees, rules, and communities. Still researching which one is best for my coin.\n    \n      🔹 Creating a token is easy… but maintaining it is the real challenge Utility, trust, community, liquidity — all these matter more than launching.\n    \n      I’m not rushing. I’m learning the foundation properly. If I understand the basics right, I can build something real later.”",
    "author": "u/ophere007",
    "timestamp": "2025-11-16T02:59:58.635000+0000",
    "post_age": "7 min. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1oyaohw/today_i_finally_understood_how_tokens_actually/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "BNB"
  },
  {
    "id": 8,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "🔥 LET THEM COOK: The Three Builders Behind Pump.fun Are Changing the Game for the People in the Trenches",
    "content": "Here’s the thing most people get wrong about Pump.fun:\n    \n      They keep trying to attach the entire movement to one name — one founder, one decision-maker, one hero to point at. But that’s not the truth. Pump.fun isn’t one man’s masterpiece.\n    \n      It’s a three-person rebellion.\n    \n      Three builders — Alon Cohen, Dylan Kerler, and Noah Tweedale — all young, all hungry, all shaped by the same fire — decided they were done with crypto being a playground for VCs, insiders, and polished pretenders.\n    \n      And together? They built the only platform I’ve seen in years that actually gives a damn about the people in the trenches.\n    \n      ⸻\n    \n      🧩 These guys didn’t come from Silicon Valley privilege — they came from the chaos\n    \n      Let’s be honest:\n    \n      None of these three founders grew up cushioned from the mess. None of them learned crypto from think tanks or corporate advisory boards.\n    \n      They learned it in the dirt, the same place the rest of us did: •\tDealing with scam coins •\tGetting blindsided by rug pulls •\tWatching influencers pump garbage •\tPraying a 2x would save rent •\tLearning hard lessons with real money on the line\n    \n      Dylan’s early crypto history made headlines — and not in a flattering way. Teenage mistakes, hype coins, abandoned projects… the whole wild cycle.\n    \n      People gossip about it. People point fingers. People pretend they’re above it.\n    \n      But I’ll tell you right now:\n    \n      Anyone who’s been in crypto since 2017 knows exactly how easy it was to get pulled into that shit.\n    \n      People forget: These founders weren’t masterminds back then. They were kids in the same trenches the rest of us were suffocating in.\n    \n      And you know what? Mistakes make you sharper. They show you exactly where the system cheats people. They show you what not to build.\n    \n      These three didn’t hide from the past — they built the solution they wished existed back then.\n    \n      ⸻\n    \n      💥 Pump.fun isn’t a platform — it’s a correction\n    \n      Alon brought the product intuition. Dylan brought the bleeding-edge crypto instincts (both the good and the hard-learned). Noah brought the infrastructure mind that turned chaos into a scalable system.\n    \n      Together, they created something crypto desperately needed:\n    \n      A place where regular people — not elites — can build, trade, create, and maybe finally catch a real break.\n    \n      They built a system where: •\tCreators get paid instead of preyed on •\tFees get pushed back into the ecosystem •\tTransparency replaces manipulation •\tCommunity takeovers keep dead projects alive •\tRevenue gets shared •\tThe platform eats last\n    \n      That wasn’t an accident. That was design.\n    \n      These three knew what retail grinders were going through because they had lived that life themselves — raw, broke, and experimenting like the rest of us.\n    \n      ⸻\n    \n      🔥 Redistribution isn’t charity — it’s philosophy\n    \n      Here’s what I respect about this trio:\n    \n      They didn’t try to “protect retail” by condescending to us. They didn’t try to act like saviors. They didn’t show up with lectures and “sustainable models” and regulatory jargon.\n    \n      They showed up and said:\n    \n      “What if we actually paid the people doing the work?”\n    \n      And then they did something no other platform in crypto history has done:\n    \n      They engineered a creator economy where being small is not a disadvantage — it’s the entire point.\n    \n      The payouts? The creator fees? The revenue share? The buybacks?\n    \n      That’s not corporate generosity. That’s not PR.\n    \n      That’s a group of founders who remember the pain of grinding for nothing — and built a system to flip the hierarchy.\n    \n      ⸻\n    \n      🌪️ The airdrop hype misses the bigger revolution\n    \n      People keep talking about the airdrop like it’s the whole story: “How big will it be?” “What tier am I in?” “Will I make it?”\n    \n      But you know what the real story is?\n    \n      Three builders decided to hand the keys of crypto wealth back to the people actually showing up.\n    \n      And the trenches needed that. Badly.\n    \n      Because most of us — especially the ones doing millions in volume with nothing but scars to show for it — haven’t had a win in a long damn time.\n    \n      Pump.fun isn’t just airdrops. It’s a redistribution of opportunity.\n    \n      A new meta. A new culture. A new way of saying:\n    \n      “If you’re willing to work, you deserve a shot too.”\n    \n      ⸻\n    \n      🌞 The trenches finally have a team building for them\n    \n      This trio isn’t perfect. They’ve made mistakes. They’ve taken heat. They’ve had to grow up publicly in a market that eats founders alive.\n    \n      But they never stopped building. They never stopped innovating. They never stopped funneling value back into the ecosystem.\n    \n      And they damn sure never forgot what it feels like to be broke, hungry, and praying for one good coin to turn your life around.\n    \n      That’s why I believe in what they’re doing. That’s why I keep building. That’s why I still see hope.\n    \n      Because for the first time in a long time, the crypto world has founders who aren’t looking down on the trenches — they came from the trenches.\n    \n      So let them cook. Let them experiment. Let them reshape this landscape brick by brick.\n    \n      And if you’re reading this from the bottom — wallet scarred, hopes dented, lessons expensive —\n    \n      know this: There are builders out there designing a system for people like us. And they’re cooking something the whole industry will feel.",
    "author": "u/Familiar-Nobody7877",
    "timestamp": "2025-11-16T02:46:20.118000+0000",
    "post_age": "21 min. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1oyaelo/let_them_cook_the_three_builders_behind_pumpfun/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 9,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "lmeow👇",
    "content": "",
    "author": "u/bossymouse123",
    "timestamp": "2025-11-15T23:11:41.983000+0000",
    "post_age": "4 hr. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1oy5u2x/lmeow/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 38,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "BUY $NONUT BEFORE ITS TOO LATE",
    "content": "lowest price in days and it will go up from now its just started pumpin again , buy and you will not regret it\n    \n      https://phantom.com/tokens/solana/8joYospwZhDn27YqjksrUeD6sPWEsfFZRmrw5uh7pump?referralId=9ia9kiwrxak",
    "author": "u/Ayan_Duma1",
    "timestamp": "2025-11-05T08:44:42.909000+0000",
    "post_age": "11 days ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1ooxq6v/buy_nonut_before_its_too_late/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "NONUT"
  },
  {
    "id": 40,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "Solana just dipped below $150. Are we cooked? Or are the trenches about to see the biggest bullrun yet?",
    "content": "The whole market is red and Solana has traded at $148. A few are still bearish, but for many who believe this is the bottom, this could be the last generational entry before a huge reversal.\n    \n      I personally bought up some Solana on Spot just now around $150.\n    \n      Are there any communities that are staying alive through this bloody week?",
    "author": "u/Dependent-Dig1905",
    "timestamp": "2025-11-05T00:33:41.318000+0000",
    "post_age": "11 days ago",
    "upvotes_likes": 7,
    "comment_count": 16,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1ooohiv/solana_just_dipped_below_150_are_we_cooked_or_are/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "150"
  },
  {
    "id": 45,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "3I/ATLAS is on its way… and $THC saw it coming first",
    "content": "",
    "author": "u/Stunning-Ad-5540",
    "timestamp": "2025-11-04T22:30:33.278000+0000",
    "post_age": "11 days ago",
    "upvotes_likes": 1,
    "comment_count": 6,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1ooli7f/3iatlas_is_on_its_way_and_thc_saw_it_coming_first/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "THC"
  },
  {
    "id": 48,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "We just went public on a RED Market, $POOF! Haha",
    "content": "",
    "author": "u/Shillme021365",
    "timestamp": "2025-11-04T17:50:18.769000+0000",
    "post_age": "11 days ago",
    "upvotes_likes": 4,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1ooe0j0/we_just_went_public_on_a_red_market_poof_haha/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "POOF"
  },
  {
    "id": 51,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "Yo, Wake Up Sheeple: $THC Ain’t Just Weed Vibes, It’s the Key to Unlocking the Matrix",
    "content": "",
    "author": "u/crlong11",
    "timestamp": "2025-11-04T14:20:12.124000+0000",
    "post_age": "12 days ago",
    "upvotes_likes": 6,
    "comment_count": 5,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1oo8dgr/yo_wake_up_sheeple_thc_aint_just_weed_vibes_its/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "THC"
  },
  {
    "id": 56,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "$SOL below $160, trenchers are we good?",
    "content": "",
    "author": "u/silverous",
    "timestamp": "2025-11-04T11:11:16.805000+0000",
    "post_age": "12 days ago",
    "upvotes_likes": 3,
    "comment_count": 9,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1oo4o11/sol_below_160_trenchers_are_we_good/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SOL"
  },
  {
    "id": 111,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Stack $HUNT early with Games, Giveaways & Pre-Launch Competitions",
    "content": "",
    "author": "u/Obvious_Errors",
    "timestamp": "2025-08-06T16:45:11.192000+0000",
    "post_age": "3 mo. ago",
    "upvotes_likes": 26,
    "comment_count": 61,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mj9swc/stack_hunt_early_with_games_giveaways_prelaunch/",
    "post_type": "video",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "HUNT"
  },
  {
    "id": 115,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Serenity Burns 140,000 $SERSH Tokens",
    "content": "Serenity has completed a strategic token burn, permanently removing 140,000 $SERSH from circulation. This action underscores the project’s long-term commitment to a sustainable and deflationary token model that enhances value for the entire ecosystem.\n    \n      The burn reflects growing adoption of Serenity’s solutions by corporate and institutional partners, as real-world integration of its products continues to accelerate.\n    \n      Key outcomes of the burn include:• Reduced token supply, increasing potential demand for $SERSH• Reinforced market trust through transparent, deflationary economics• Strengthened momentum ahead of major ecosystem growth milestones\n    \n      This marks the first of multiple planned burns tied to Serenity’s long-term roadmap. With token utility expanding globally, $SERSH remains central to the project’s secure, decentralized infrastructure for digital asset management and inheritance.\n    \n      As Serenity scales, $SERSH is built to scale with it.https://coinmarketcap.com/currencies/serenity-shield/",
    "author": "u/SwordfishVisual9120",
    "timestamp": "2025-08-05T18:34:06.963000+0000",
    "post_age": "3 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mihbug/serenity_burns_140000_sersh_tokens/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SERSH"
  },
  {
    "id": 117,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Superp ($SUP) and the Growing Trend of Meme Focused Perp DEXs",
    "content": "It’s wild how fast the space moves. Just when you think you’ve seen it all, perp DEXs built specifically for meme coins start popping up, and honestly, it kind of makes sense.We’ve already seen how meme tokens like $DOGE, $PEPE, and countless others can drive insane volume, attention, and volatility. So why not create dedicated places where traders can long, short, and speculate on these assets with more precision?\n    \n      Meme focused perp DEXs are tapping into this momentum by building platforms that cater directly to degens and casual traders alike, aiming for smooth user experience, quick execution, and less of the complicated setup that comes with traditional DeFi trading. Whether you're farming microcaps or chasing momentum plays, having the ability to trade perps on memes changes the game a bit.\n    \n      Some of these DEXs are still early, but the trend is growing. And with Bitget set to list Superp ($SUP), a token tied to this niche, it shows that the narrative is starting to catch wider attention.Will these platforms become the standard for meme trading? Time will tell. But if you’re already trading meme coin, keeping an eye on this perp DEX wave might not be a bad idea. Just remember to manage your risk, it’s all fun and games until the charts go vertical. the wrong way.\n    \n      https://coinmarketcap.com/currencies/superp/",
    "author": "u/Then_Helicopter4243",
    "timestamp": "2025-08-04T22:21:23.721000+0000",
    "post_age": "3 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mhrpcy/superp_sup_and_the_growing_trend_of_meme_focused/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SUP"
  },
  {
    "id": 118,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "\"Another frog coin?\" Not quite. Pepecoin ($PEP) is something else entirely.",
    "content": "",
    "author": "u/TeranyaTipper",
    "timestamp": "2025-08-04T17:35:27.501000+0000",
    "post_age": "3 mo. ago",
    "upvotes_likes": 8,
    "comment_count": 8,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mhk14g/another_frog_coin_not_quite_pepecoin_pep_is/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "PEP"
  },
  {
    "id": 119,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Daily Games & Lotteries with $HUNT Bot - Major Docs Released + Massive Pre-Launch Trials",
    "content": "",
    "author": "u/Obvious_Errors",
    "timestamp": "2025-08-04T16:48:01.668000+0000",
    "post_age": "3 mo. ago",
    "upvotes_likes": 32,
    "comment_count": 38,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mhipls/daily_games_lotteries_with_hunt_bot_major_docs/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "HUNT"
  },
  {
    "id": 124,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$WAGMI has a new doxxed live stream",
    "content": "",
    "author": "u/frostedflakess52",
    "timestamp": "2025-08-02T13:06:28.933000+0000",
    "post_age": "4 mo. ago",
    "upvotes_likes": 9,
    "comment_count": 12,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mfq3je/wagmi_has_a_new_doxxed_live_stream/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "WAGMI"
  },
  {
    "id": 126,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Get informed - Whitepaper, Tokenomics, Roadmap and rewards all live for $HUNT",
    "content": "",
    "author": "u/Obvious_Errors",
    "timestamp": "2025-08-01T20:47:33.967000+0000",
    "post_age": "4 mo. ago",
    "upvotes_likes": 35,
    "comment_count": 31,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mf7t8m/get_informed_whitepaper_tokenomics_roadmap_and/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "HUNT"
  },
  {
    "id": 130,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Fastex just became the first exchange to issue collectible currency notes backed 1:1 by the $FTN token",
    "content": "Fastex just became the first exchange in the world to issue collectible currency notes that are fully backed 1:1 by their native FTN token. Each note has legit anti-counterfeit features (think banknote-grade ink, serials, security foil, etc) and can be redeemed anytime for FTN on the exchange.\n    \n      Notes can be verified via NFTs, which are burned once redeemed. Plus, they announced these at their big Web3/iGaming event alongside a crypto debit card drop.\n    \n      It seems like a really cool way to utilize crypto tech IMO. I also think that this will probably start a new trend in crypto.\n    \n      What are your thoughts?\n    \n      Source - https://www.thestreet.com/crypto/press-releases/fastex-becomes-first-exchange-globally-to-issue-collectible-currency-notes-backed-11-by-ftn-token\n    \n      Coingecko listing : https://www.coingecko.com/en/coins/fasttoken",
    "author": "u/CuriousGeorge22_02",
    "timestamp": "2025-07-31T14:38:28.030000+0000",
    "post_age": "4 mo. ago",
    "upvotes_likes": 34,
    "comment_count": 5,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1me3bx0/fastex_just_became_the_first_exchange_to_issue/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "FTN"
  },
  {
    "id": 131,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$HUNT launches this Saturday -;Whitepaper, Roadmap & Token info now live!",
    "content": "The wait is almost over - \"$HUNT officially launches this Saturday, August 2nd on Solana!*\n    \n      Ahead of the big drop, the Whitepaper, Roadmap, and full Tokenomics are now live on the official site, giving you a full look at what’s coming and how $HUNT operates.\n    \n      ✅ Whitepaper: See the full vision behind the project ✅ Roadmap: Explore what’s ahead for the ecosystem ✅ Tokenomics: Get a transparent look at distribution & mechanics\n    \n      Right now, you can still join the Telegram and take part in daily lotteries to win free $HUNT before launch. And after launch? Holders will receive SOL rewards automatically—no need to claim.\n    \n      Get in early and be part of something big.\n    \n      🔗 All links and resources here: https://linktr.ee/hunt_on_sol\n    \n      Rewards token: https://www.coingecko.com/en/coins/solana",
    "author": "u/Obvious_Errors",
    "timestamp": "2025-07-31T11:24:39.120000+0000",
    "post_age": "4 mo. ago",
    "upvotes_likes": 52,
    "comment_count": 34,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mdyxtl/hunt_launches_this_saturday_whitepaper_roadmap/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "HUNT"
  },
  {
    "id": 133,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Trying to Catch $GAIA Early Without Rushing In",
    "content": "I had already gone through the project before it launched, and it felt like there was real structure to it. Not just another AI name flying around. They’ve got a setup with agent discovery, secure node handling, and a staking system that’s supposed to keep the network stable and trustworthy\n    \n      $GAIA just got listed on bitget and the price doesn’t look bad to me. Nothing crazy yet, but I’m not in a hurry to market buy. i have even noticed launchpool is still running, which i think i can use to pick up some extra on the side to get a bit more before things move higher.\n    \n      They’re also pushing for wide adoption from the start  targeting 500k holders and building rewards through GaiaPoints and credits that actually tie back into the token.\n    \n      I’m not expecting miracles, but when something is built with intention, it usually shows in how it moves after listing. So right now, I’m just quietly positioning through the event together with the token and watching how it plays out.https://www.coingecko.com/en/coins/gaia-3",
    "author": "u/Fit_Negotiation_1207",
    "timestamp": "2025-07-30T21:59:19.801000+0000",
    "post_age": "4 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mdjttr/trying_to_catch_gaia_early_without_rushing_in/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "GAIA"
  },
  {
    "id": 134,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Serenity :  CROSSCHAIN IS COMING — $SERSH GOES MULTI-CHAIN!",
    "content": "Serenity is taking the next big leap in Web3.The $SERSH token is about to go cross-chain, unlocking a new era of accessibility, liquidity, and blockchain interoperability.\n    \n      To celebrate this milestone, we’re hosting a special giveaway:💳 1 sAxess Biometric Card💰 + 500 $SERSH Tokens\n    \n      Think you know where we’re heading next?🔥 GUESS THE NEW CHAIN and drop your answer in the comments on X!\n    \n      🗓 Ends August 5, 2025👉 https://x.com/serenitystech/status/1950135548162568513?s=46\n    \n      Try your luck, guess right, and you might just land a nice surprise. 🎁https://coinmarketcap.com/currencies/serenity-shield/",
    "author": "u/SwordfishVisual9120",
    "timestamp": "2025-07-29T16:25:05.948000+0000",
    "post_age": "4 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1mcg06y/serenity_crosschain_is_coming_sersh_goes/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SERSH"
  },
  {
    "id": 148,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$BLUM Just Listed and Already Pumping",
    "content": "BLUM just listed and it’s already up over 1,200% from its low, currently trading around $0.13.\n    \n      Could be early hype… or just the beginning.\n    \n      i expect a early farmers to sell off abit before there is a price stabilization...\n    \n      What’s your take... real momentum or quick pump? 👀will be add some bags with the Bitget PoolX to farm rewards while waiting for the next move.\n    \n      what do yall think?\n    \n      https://coinmarketcap.com/currencies/blum/",
    "author": "u/Green_Candler",
    "timestamp": "2025-06-27T11:50:14.883000+0000",
    "post_age": "5 mo. ago",
    "upvotes_likes": 2,
    "comment_count": 3,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1llrvli/blum_just_listed_and_already_pumping/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "BLUM"
  },
  {
    "id": 150,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Discover Moonveil – Seamless Cross-Game Play with $MORE Token",
    "content": "Moonveil is an innovative Web3 gaming ecosystem built on a custom Layer-2 blockchain that leverages zkEVM technology and Polygon CDK to support mid-core games through a modular infrastructure. It aims to provide seamless cross-game identity and asset interoperability with low friction for both developers and gamers. The ecosystem is powered by the native token $MORE, which acts as a unified gas token across the chain and offers utility within the various games and the broader platform economy.\n    \n      Moonveil also implements a loyalty and badge system called “Moon Beams” alongside incentivized programs designed to engage users early through airdrops and node-sale rewards. The project targets mid-core gamers with multiple titles including Astrark, a tower defense game; Bushwhack, a stealth battle royale; Flaming Pets, a multiplayer on-chain mini-game spanning 25 castles; as well as several casual mini-games. The Layer-2 chain features support for ZK scaling, wallet abstractions, and data availability mechanisms to reduce gas friction and improve user experience.\n    \n      Key features of Moonveil include its modular zkEVM Layer-2 built on Polygon CDK, which enables a scalable, customizable environment for building games while maintaining security through zero-knowledge proofs and ensuring low gas costs. Players benefit from cross-game asset portability, allowing them to carry their identities, NFTs, and items between games such as Astrark, Bushwhack, and Flaming Pets, thereby enhancing engagement and retention. The Flaming Pets game serves as an initial testbed to showcase the performance and user experience of the Layer-2 chain. Beyond marketplace transactions, $MORE facilitates cross-platform trading, enabling seamless exchange of assets between different games and applications within the Moonveil ecosystem. Additionally, players can use $MORE to unlock premium content, access exclusive events, and enhance gameplay modes, which boosts engagement while rewarding active participation.\n    \n      $MORE is set to be listed on Bitget Exchange on June 27, and to celebrate, Bitget is hosting the Moonveil x Bitget $MORE Token Special Campaign. New users can participate by downloading the Bitget app and registering exclusively through a link, completing KYC, and becoming eligible to receive between 50 to 200 $MORE tokens from a prize pool of 1,800,000 $MORE. The promotion runs from June 24, 10 AM UTC to July 11, 10 AM UTC.\n    \n      https://www.coingecko.com/en/coins/moonveil",
    "author": "u/DAHUDMJ",
    "timestamp": "2025-06-27T00:09:45.615000+0000",
    "post_age": "5 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1llfvu1/discover_moonveil_seamless_crossgame_play_with/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "MORE"
  },
  {
    "id": 155,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$SICKB has just built and booted its own blockchain",
    "content": "",
    "author": "u/Economy_Growth9433",
    "timestamp": "2025-06-24T11:47:58.128000+0000",
    "post_age": "5 mo. ago",
    "upvotes_likes": 6,
    "comment_count": 7,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1lj8z3u/sickb_has_just_built_and_booted_its_own_blockchain/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SICKB"
  },
  {
    "id": 163,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Serenity Two Competitions, One Week – Over $10,000 in Rewards Distributed!",
    "content": "Last week was a big one for the Serenity community!\n    \n      We successfully wrapped up two major events:🔹 Our latest AMA session with CPO & Co-Founder Robert Boris Mofrad🔹 The $SERSH Buy & HODL Competition\n    \n      🪙 Across both events, we awarded over $10,000 in USDT prizes to community members who showed creativity, insight, and dedication.\n    \n      These events are a reminder of what Serenity is all about – rewarding curiosity, supporting bold ideas, and building the future together.\n    \n      🌐 Whether you’re here to ask the big questions, dive into real utility, or just be part of something meaningfulNow is the time to be part of Serenity.Be part of the community.Be part of the future.https://coinmarketcap.com/currencies/serenity-shield/",
    "author": "u/SwordfishVisual9120",
    "timestamp": "2025-05-19T18:59:36.369000+0000",
    "post_age": "6 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1kqjzk2/serenity_two_competitions_one_week_over_10000_in/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "10"
  },
  {
    "id": 169,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "🚀🔥Sick Buffalo ($SICKB) Launches on Ethereum L1 — Staking Now Live🦬🦬",
    "content": "",
    "author": "u/Economy_Growth9433",
    "timestamp": "2025-05-17T18:53:18.106000+0000",
    "post_age": "6 mo. ago",
    "upvotes_likes": 5,
    "comment_count": 4,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1kp0bsn/sick_buffalo_sickb_launches_on_ethereum_l1/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SICKB"
  },
  {
    "id": 177,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$KENDU- Crypto’s next evolution!",
    "content": "",
    "author": "u/Speakerguy13",
    "timestamp": "2025-05-14T17:40:20.688000+0000",
    "post_age": "6 mo. ago",
    "upvotes_likes": 58,
    "comment_count": 11,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1kmletv/kendu_cryptos_next_evolution/",
    "post_type": "gallery",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "KENDU"
  },
  {
    "id": 179,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Is $SKYAI the next Top BNB project?",
    "content": "CZ has continue to claim that AI and utility projects will top the next bull-run and we all know he is actively promoting Binance Smart Chain projects especially memecoin lately but could SKYAI  be that AI project he keep referring to? SkyAI is a multi-chain AI platform built on BNB Chain, designed to deliver intelligent solutions across industries like finance, healthcare, and Web3.  It native token $SKYAI recently hit above $13.02M market cap after listing on Bitget.\n    \n      What sets SkyAI apart is its real-time access to on-chain data, a game-changer for blockchain analytics and large language model applications and this is why  many feel this could be the next top AI project but what do you  think?\n    \n      https://coinmarketcap.com/currencies/skyai/",
    "author": "u/Donsaudi29",
    "timestamp": "2025-05-14T08:09:03.993000+0000",
    "post_age": "6 mo. ago",
    "upvotes_likes": 2,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1km9tbb/is_skyai_the_next_top_bnb_project/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SKYAI"
  },
  {
    "id": 188,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Holding Bitcoin Is Awesome, But What If It Could Do Better with $PUMP",
    "content": "As much as a Bitcoin holder as I am, I've always considered BTC a long-term hold, something to hold on to, not use actively. That was until I found PumpBTC, a liquid staking protocol that turns on its head what Bitcoin can accomplish in the DeFi ecosystem.\n    \n      Instead of simply having BTC held in a wallet, PumpBTC enables owners to stake their Bitcoin and earn $PUMPBTC tokens in return. The tokens accrue yields automatically via the Babylon protocol, giving a way to use Bitcoin without having to relinquish ownership.\n    \n      Right now, the pre-deposit phase for $PUMPBTC is live, meaning early participants can start staking. Bitg3t is also running a zero gas fee deposit event, making it easier to get involved without extra transaction costs.\n    \n      It’s an interesting shift—Bitcoin moving beyond just holding and into active participation in DeFi. I’m still exploring what this could mean long-term, but it’s definitely worth watching.\n    \n      What's your opinion regarding Bitcoin staking? Would you ever do it?\n    \n      https://coinmarketcap.com/currencies/pumpbtc-pump/",
    "author": "u/Omegacarlos1",
    "timestamp": "2025-04-01T16:03:00.115000+0000",
    "post_age": "8 mo. ago",
    "upvotes_likes": 0,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1joza1p/holding_bitcoin_is_awesome_but_what_if_it_could/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "PUMP"
  },
  {
    "id": 203,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Walrus ($WAL) Airdrop Just Lifted Some Out The Trenches",
    "content": "Walrus, a decentralized storage network on Sui, officially listed today on Bitget and other exchanges, and the airdrop got a lot of attention. Saw someone on twitter who got $60K from $WAL airdrop. SIXTY THOUSAND US DOLLARS.\n    \n      What is Walrus?\n    \n      Walrus is designed for storing and delivering raw data, including videos, images, and PDFs. It improves on solutions like Filecoin and Arweave, introducing programmable, scalable storage that works for real-time applications rather than just archiving.\n    \n      Key Features:\n    \n      Optimized Storage – Reduces costs by up to 80% using advanced coding techniques.\n    \n      Resilient Network – Maintains data access even if a large portion of nodes fail.\n    \n      Programmable Storage – Turns storage into a tokenized asset, enabling smart contract-based storage marketplaces.\n    \n      Governance & Staking – WAL holders vote on network parameters and secure the system.\n    \n      Stable Pricing – Keeps storage costs predictable in fiat terms.\n    \n      It's been long since there has been an airdrop like this, lives were changed. Unfortunately I wasn't among. Were you?\n    \n      https://coinmarketcap.com/currencies/walrus-xyz/",
    "author": "u/Woodpecker5987",
    "timestamp": "2025-03-27T16:07:59.739000+0000",
    "post_age": "8 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1jl7j20/walrus_wal_airdrop_just_lifted_some_out_the/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "WAL"
  },
  {
    "id": 214,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "New moonshot meme coin $AWR (All Will Retire) x100 potential, released 14 days ago",
    "content": "Guys, check out $AWR (All Will Retire Coin).\n    \n      It's been released on Jan 11th with the price about 0.001$, today's price is 0.008$, so it hasn't pumped much yet.\n    \n      The market cap is ONLY 8 MILLION USD. So this is x100 potential.\n    \n      I bought at 0.004 so already made x2. It is not listed on any exchange yet, you can get it through Phantom wallet (with SOL).\n    \n      Check out the fundamentals. Seems solid.\n    \n      NFI: Invest only what you can afford to lose, it's a meme coin afterall. I put in 250$, in two days it increased to 550$.\n    \n      https://www.coingecko.com/en/coins/all-will-retire",
    "author": "u/Jessyy97",
    "timestamp": "2025-01-25T13:52:29.953000+0000",
    "post_age": "10 mo. ago",
    "upvotes_likes": 0,
    "comment_count": 20,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1i9nd8e/new_moonshot_meme_coin_awr_all_will_retire_x100/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "AWR"
  },
  {
    "id": 219,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "New moonshot meme coin $AWR (All Will Retire) x100 potential, released 14 days ago",
    "content": "Guys, check out $AWR (All Will Retire Coin).\n    \n      It's been released on Jan 11th with the price about 0.001$, today's price is 0.008$, so it hasn't pumped much yet.\n    \n      The market cap is ONLY 8 MILLION USD. So this is x100 potential.\n    \n      I bought at 0.004 so already made x2. It is not listed on any exchange yet, you can get it through Phantom wallet (with SOL).\n    \n      Check out the fundamentals. Seems solid.\n    \n      NFI: Invest only what you can afford to lose, it's a meme coin afterall. I put in 250$, in two days it increased to 550$.\n    \n      https://www.coingecko.com/en/coins/all-will-retire",
    "author": "u/Jessyy97",
    "timestamp": "2025-01-25T13:52:29.953000+0000",
    "post_age": "10 mo. ago",
    "upvotes_likes": 0,
    "comment_count": 20,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1i9nd8e/new_moonshot_meme_coin_awr_all_will_retire_x100/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "AWR"
  }
]