[
  {
    "id": 1,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "The World's going full degen, be better",
    "content": "Platforms like Polymarket are exploding in hype, where you can bet on elections, weather, and even celebrity divorcesSome analysts suggest the reason there was no real altcoin season this bull run is because so much money was diverted into these gambling platforms\n    \n      Meanwhile, the crypto space has been taken over by memecoins that rug at the slightest profit.From Argentina’s president to that 13-year-old kid, everyone seems to be trying to make a quick buckIt’s peak degeneracy\n    \n      And that’s exactly why RAWW stands out\n    \n      RAWW isn’t built around the degen/casino mindsetIt leans in the opposite direction, the natural-living, anti-degen movement that’s exploding outside of crypto\n    \n      People are tired of everything synthetic, tired of dopamine traps, tired of projects designed just to pump and dump.\n    \n      RAWW taps into that shift with a meme that actually has a foundation:\n    \n      • An ASMR clicker game live• weekly webtoon chapters• A RAWW Album ( 13 songs )• 100% natural merch• an IRL narrative with real personality and voice (the RAWW Milk Man)• and a community that builds instead of gambles• The RAWW truth series ( launching very soon )\n    \n      While everyone else is pushing degeneracy, RAWW is pushing back.\n    \n      It’s not the loudest coin or the flashiest, but it’s one of the few doing something different, and doing it consistently.\n    \n      If you want off the degen treadmill, RAWW is one of the only memes this cycle that isn’t built on pure luck, hype or dopamine.\n    \n      Be DifferentBe RealBe RAWW\n    \n      Mcap: 130k\n    \n      CA: 8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5pLinktree: https://linktr.ee/RAWWMilkCryptoCMC:https://dex.coinmarketcap.com/token/solana/8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5p/",
    "author": "u/Ok_Poem_2813",
    "timestamp": "2025-11-15T18:55:00.254000+0000",
    "post_age": "9 hr. ago",
    "upvotes_likes": 10,
    "comment_count": 4,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "Building an actual brand, not just a token. $RAWW",
      "natural living narrative is only getting bigger. glad I found this early. $RAWW",
      "Yeah, it’s getting more and more popular every day"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxzpg9/the_worlds_going_full_degen_be_better/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "RAWW"
  },
  {
    "id": 2,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Anyone grinding small caps on Tron?",
    "content": "I've been scouting micro-cap gems on the Tron network lately, the kind with market caps under 10M that can explode if some real volume rolls in. You get it - those degenerate plays where timing is everything, but fees kill the vibe. Every swap, transfer, or contract call drains energy like crazy, and if I stake a ton of TRX to build up resources, that's capital stuck that I could use for jumping into more positions. It's frustrating when you're trying to flip quick without bleeding out on costs.\n    \n      Last week, I got fed up and tested renting energy from tr.energy. Super straightforward: punch in your wallet address, choose a rental period - I went with 24 hours to keep it short - drop a handful of TRX as payment, and boom, the energy shows up in your account in less than a minute. No hassle, no waiting around. I ran a bunch of USDT transfers for three different token flips that day, and it cut my costs by around 60% compared to burning energy outright. Best part? Zero KYC nonsense, no locking up your funds long-term, and it doesn't mess with anything on-chain - just a quick boost to your resources so you can trade freely.\n    \n      It's a game-saver for low-volume stuff where you don't want to commit big. Before this, I'd burn through extra TRX or skip trades altogether. Now, I can hit those sketchy micro-caps without second-guessing fees. You guys rent energy like this for your degen hunts, or do you have other tricks? What's your go-to hack for dodging fees on those high-risk, low-MC coins? Share if you've got something better - curious if there's a free option or something I missed",
    "author": "u/Busternookiedude",
    "timestamp": "2025-11-15T18:32:37.017000+0000",
    "post_age": "9 hr. ago",
    "upvotes_likes": 1,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxz577/anyone_grinding_small_caps_on_tron/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "TRX"
  },
  {
    "id": 3,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Microsoft + Google Supported Project on Solana… Potential Sleeper?",
    "content": "I hadn’t heard much about Biokript Pro until recently, but it’s suddenly showing up everywhere. After digging into it, it actually looks like one of the more serious builds happening on Solana right now. It positions itself as the first patented hybrid DEX on Solana, focused on trader protection, automated execution tools, and long-term value sharing rather than hype.\n    \n      Here are the standout points: • Patented Rug-Pull Protection: Built-in logic that helps prevent malicious liquidity drains, addressing one of the biggest risks in DeFi. • First On-Chain Stop-Loss on Solana: Traders can set automated stop-losses while keeping full control of their wallet. No other Solana DEX offers true on-chain stop-loss execution. • Profit Sharing for Holders: 50 percent of all trading fees are distributed to BIOK token holders, treating the community as true partners. • Microsoft + Google Cloud Support: The team secured verified support from both, including over $100K in combined resources for scaling, infrastructure, and performance. I had verified this on the telegram group. • Ultra-Low 0.1 Percent Fee: 10X lower than most competitors like Axiom, making it more attractive for real trading volume. • Hybrid Execution Architecture: Combines decentralized control with CEX-level speed, automation, and rug pull protection.\n    \n      With Solana’s surge of new DEXs, many are just clones or basic routers. Biokript Pro is actually trying to solve real trading pain points like safety, automation, and fair value alignment. If they deliver everything they’ve outlined, this might end up being one of the more meaningful utility platforms going into the next altseason.\n    \n      Their presale on Pinksale ends on November 17 at 19:00 UTC, so it will be interesting to see how things unfold as they move toward launch.\n    \n      Anyone else following this? Would love to hear thoughts from traders who have been waiting for proper onchain stop loss and safer execution tools. https://biokript.com",
    "author": "u/SeriousExamination49",
    "timestamp": "2025-11-15T15:27:27.559000+0000",
    "post_age": "12 hr. ago",
    "upvotes_likes": 1,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "“Hadn’t heard much about”, except via your daily shills."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxugoj/microsoft_google_supported_project_on_solana/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "BIOK"
  },
  {
    "id": 4,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$MERL Is Showing Strength Amid Market Volatility, But What Could Be Next for Its Move?",
    "content": "$MERL rose 2.44% in the last 24 hours, moving ahead of the broader crypto market. I’ve been watching it after the recent volatility and it started showing some signs of stabilization. Network upgrades, new exchange support, and a short-term technical rebound all seemed to line up, but seeing it move in real time feels different from just reading charts.\n    \n      I decided to trade it on Bitget as part of the Trading Club Championship Phase 17. I’m not chasing anything, just following $MERL, making small moves, and seeing how it behaves. The extra BGB from the challenge is just part of the process, not the reason I’m trading, mostly it’s about watching how it flows in the market.\n    \n      It makes you wonder if setups like this can appear quietly, what else might be forming in the background that most people aren’t noticing?\n    \n      https://coinmarketcap.com/currencies/merlin-chain",
    "author": "u/Feisty-Rhubarb-6718",
    "timestamp": "2025-11-15T23:24:35.967000+0000",
    "post_age": "4 hr. ago",
    "upvotes_likes": 2,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Yeah fr, $MERL holding strong in this volatility is kinda crazy. Watching it on Bitget makes sense...small moves, no stress....low-key feels like something bigger might be forming in the background, but we shouldn't expect much"
    ],
    "link": "https://www.reddit.com/r/altcoin/comments/1oy64hv/merl_is_showing_strength_amid_market_volatility/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "MERL"
  },
  {
    "id": 5,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "The World's going full degen, be better",
    "content": "Platforms like Polymarket are exploding in hype, where you can bet on elections, weather, and even celebrity divorcesSome analysts suggest the reason there was no real altcoin season this bull run is because so much money was diverted into these gambling platforms\n    \n      Meanwhile, the crypto space has been taken over by memecoins that rug at the slightest profit.From Argentina’s president to that 13-year-old kid, everyone seems to be trying to make a quick buckIt’s peak degeneracy\n    \n      And that’s exactly why RAWW stands out\n    \n      RAWW isn’t built around the degen/casino mindsetIt leans in the opposite direction, the natural-living, anti-degen movement that’s exploding outside of crypto\n    \n      People are tired of everything synthetic, tired of dopamine traps, tired of projects designed just to pump and dump.\n    \n      RAWW taps into that shift with a meme that actually has a foundation:\n    \n      • An ASMR clicker game live• weekly webtoon chapters• A RAWW Album ( 13 songs )• 100% natural merch• an IRL narrative with real personality and voice (the RAWW Milk Man)• and a community that builds instead of gambles• The RAWW truth series ( launching very soon )\n    \n      While everyone else is pushing degeneracy, RAWW is pushing back.\n    \n      It’s not the loudest coin or the flashiest, but it’s one of the few doing something different, and doing it consistently.\n    \n      If you want off the degen treadmill, RAWW is one of the only memes this cycle that isn’t built on pure luck, hype or dopamine.\n    \n      Be DifferentBe RealBe RAWW\n    \n      Mcap: 130k\n    \n      CA: 8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5pLinktree: https://linktr.ee/RAWWMilkCryptoCMC:https://dex.coinmarketcap.com/token/solana/8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5p/",
    "author": "u/Ok_Poem_2813",
    "timestamp": "2025-11-15T18:55:03.703000+0000",
    "post_age": "9 hr. ago",
    "upvotes_likes": 14,
    "comment_count": 6,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "RAWW is simply just better",
      "Ok_Poem_2813 • 8h ago 💯",
      "milk man streams give this so much personality. RAWW",
      "Bro is a little sus sometimes but yeah lol",
      "so much going on with just 130k mcap, RAWW seems the one.",
      "Webtoon alone puts this ahead of 99% of memecoins."
    ],
    "link": "https://www.reddit.com/r/altcoin/comments/1oxzpi8/the_worlds_going_full_degen_be_better/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "RAWW"
  },
  {
    "id": 6,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Serenity Redefines Future of Digital Identity, Biometrics and Web3 Security",
    "content": "As Web3 evolves, one question defines digital trust, how can we truly prove who we are in a decentralized world? Passwords are no longer enough, and AI powered attacks expose their weaknesses, making traditional security methods obsolete.\n    \n      Serenity is leading the way with biometric authentication, using your fingerprint to combine simplicity with the highest level of protection. This approach ensures that access to digital assets is both secure and intuitive, empowering users to maintain full control over their crypto and digital identity.\n    \n      Biometrics are redefining the standards of Web3 security. By eliminating the risks associated with passwords and private key mismanagement, Serenity makes self custody safer, faster, and more reliable for everyone. This technology is not just an upgrade, it is the foundation for the next era of decentralized digital identity and asset protection.\n    \n      Serenity is not just improving security, it is changing the rules of the game, setting a new standard where your digital identity is truly yours and fully protected in the Web3 world.\n    \n      Read the full article on our blog:\n    \n      s.technology/blog/biometric-security-in-web3/\n    \n      Also available on Medium:\n    \n      serenitystech.medium.com/serenity-the-future-of-digital-identity-and-why-biometric-security-is-key-to-web3-7ac392eceda3\n    \n      https://coinmarketcap.com/currencies/serenity-shield/",
    "author": "u/SwordfishVisual9120",
    "timestamp": "2025-11-14T17:39:15.633000+0000",
    "post_age": "1 day ago",
    "upvotes_likes": 2,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1ox33kr/serenity_redefines_future_of_digital_identity/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SHIELD"
  },
  {
    "id": 7,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "Today I finally understood how tokens actually work",
    "content": "“Today was a big learning day for me. I spent hours researching how tokens actually work behind the scenes — not the hype part, the real mechanics.\n    \n      Here’s what I understood:\n    \n      🔹 Market Cap = Price × Total Supply This decides how big a coin really is. A coin isn’t “cheap” just because the price is low — the supply matters more.\n    \n      🔹 Liquidity is the lifeline of a coin If a coin has low liquidity, people can’t buy or sell easily. It becomes unstable. Good projects always have strong liquidity pools.\n    \n      🔹 Token Supply is a strategic decision Should it be:\n    \n      1 billion?\n    \n      1 trillion?\n    \n      420 million? 😆 Supply affects price psychology and community interest.\n    \n      🔹 Launch platforms matter SOL, ETH, BNB — each blockchain has different fees, rules, and communities. Still researching which one is best for my coin.\n    \n      🔹 Creating a token is easy… but maintaining it is the real challenge Utility, trust, community, liquidity — all these matter more than launching.\n    \n      I’m not rushing. I’m learning the foundation properly. If I understand the basics right, I can build something real later.”",
    "author": "u/ophere007",
    "timestamp": "2025-11-16T02:59:58.635000+0000",
    "post_age": "51 min. ago",
    "upvotes_likes": 2,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Congrats! Proceed with caution — there should be no turning back 😂"
    ],
    "link": "https://www.reddit.com/r/pumpfun/comments/1oyaohw/today_i_finally_understood_how_tokens_actually/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 8,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "🔥 LET THEM COOK: The Three Builders Behind Pump.fun Are Changing the Game for the People in the Trenches",
    "content": "Here’s the thing most people get wrong about Pump.fun:\n    \n      They keep trying to attach the entire movement to one name — one founder, one decision-maker, one hero to point at. But that’s not the truth. Pump.fun isn’t one man’s masterpiece.\n    \n      It’s a three-person rebellion.\n    \n      Three builders — Alon Cohen, Dylan Kerler, and Noah Tweedale — all young, all hungry, all shaped by the same fire — decided they were done with crypto being a playground for VCs, insiders, and polished pretenders.\n    \n      And together? They built the only platform I’ve seen in years that actually gives a damn about the people in the trenches.\n    \n      ⸻\n    \n      🧩 These guys didn’t come from Silicon Valley privilege — they came from the chaos\n    \n      Let’s be honest:\n    \n      None of these three founders grew up cushioned from the mess. None of them learned crypto from think tanks or corporate advisory boards.\n    \n      They learned it in the dirt, the same place the rest of us did: •\tDealing with scam coins •\tGetting blindsided by rug pulls •\tWatching influencers pump garbage •\tPraying a 2x would save rent •\tLearning hard lessons with real money on the line\n    \n      Dylan’s early crypto history made headlines — and not in a flattering way. Teenage mistakes, hype coins, abandoned projects… the whole wild cycle.\n    \n      People gossip about it. People point fingers. People pretend they’re above it.\n    \n      But I’ll tell you right now:\n    \n      Anyone who’s been in crypto since 2017 knows exactly how easy it was to get pulled into that shit.\n    \n      People forget: These founders weren’t masterminds back then. They were kids in the same trenches the rest of us were suffocating in.\n    \n      And you know what? Mistakes make you sharper. They show you exactly where the system cheats people. They show you what not to build.\n    \n      These three didn’t hide from the past — they built the solution they wished existed back then.\n    \n      ⸻\n    \n      💥 Pump.fun isn’t a platform — it’s a correction\n    \n      Alon brought the product intuition. Dylan brought the bleeding-edge crypto instincts (both the good and the hard-learned). Noah brought the infrastructure mind that turned chaos into a scalable system.\n    \n      Together, they created something crypto desperately needed:\n    \n      A place where regular people — not elites — can build, trade, create, and maybe finally catch a real break.\n    \n      They built a system where: •\tCreators get paid instead of preyed on •\tFees get pushed back into the ecosystem •\tTransparency replaces manipulation •\tCommunity takeovers keep dead projects alive •\tRevenue gets shared •\tThe platform eats last\n    \n      That wasn’t an accident. That was design.\n    \n      These three knew what retail grinders were going through because they had lived that life themselves — raw, broke, and experimenting like the rest of us.\n    \n      ⸻\n    \n      🔥 Redistribution isn’t charity — it’s philosophy\n    \n      Here’s what I respect about this trio:\n    \n      They didn’t try to “protect retail” by condescending to us. They didn’t try to act like saviors. They didn’t show up with lectures and “sustainable models” and regulatory jargon.\n    \n      They showed up and said:\n    \n      “What if we actually paid the people doing the work?”\n    \n      And then they did something no other platform in crypto history has done:\n    \n      They engineered a creator economy where being small is not a disadvantage — it’s the entire point.\n    \n      The payouts? The creator fees? The revenue share? The buybacks?\n    \n      That’s not corporate generosity. That’s not PR.\n    \n      That’s a group of founders who remember the pain of grinding for nothing — and built a system to flip the hierarchy.\n    \n      ⸻\n    \n      🌪️ The airdrop hype misses the bigger revolution\n    \n      People keep talking about the airdrop like it’s the whole story: “How big will it be?” “What tier am I in?” “Will I make it?”\n    \n      But you know what the real story is?\n    \n      Three builders decided to hand the keys of crypto wealth back to the people actually showing up.\n    \n      And the trenches needed that. Badly.\n    \n      Because most of us — especially the ones doing millions in volume with nothing but scars to show for it — haven’t had a win in a long damn time.\n    \n      Pump.fun isn’t just airdrops. It’s a redistribution of opportunity.\n    \n      A new meta. A new culture. A new way of saying:\n    \n      “If you’re willing to work, you deserve a shot too.”\n    \n      ⸻\n    \n      🌞 The trenches finally have a team building for them\n    \n      This trio isn’t perfect. They’ve made mistakes. They’ve taken heat. They’ve had to grow up publicly in a market that eats founders alive.\n    \n      But they never stopped building. They never stopped innovating. They never stopped funneling value back into the ecosystem.\n    \n      And they damn sure never forgot what it feels like to be broke, hungry, and praying for one good coin to turn your life around.\n    \n      That’s why I believe in what they’re doing. That’s why I keep building. That’s why I still see hope.\n    \n      Because for the first time in a long time, the crypto world has founders who aren’t looking down on the trenches — they came from the trenches.\n    \n      So let them cook. Let them experiment. Let them reshape this landscape brick by brick.\n    \n      And if you’re reading this from the bottom — wallet scarred, hopes dented, lessons expensive —\n    \n      know this: There are builders out there designing a system for people like us. And they’re cooking something the whole industry will feel.",
    "author": "u/Familiar-Nobody7877",
    "timestamp": "2025-11-16T02:46:20.118000+0000",
    "post_age": "1 hr. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1oyaelo/let_them_cook_the_three_builders_behind_pumpfun/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 9,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "lmeow👇",
    "content": "",
    "author": "u/bossymouse123",
    "timestamp": "2025-11-15T23:11:41.983000+0000",
    "post_age": "5 hr. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1oy5u2x/lmeow/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 10,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "best time to buy $NONUT the biggest dip until now , untill the middle of november it wil explode , buy now or regret it later",
    "content": "",
    "author": "u/Ayan_Duma1",
    "timestamp": "2025-11-01T18:39:37.515000+0000",
    "post_age": "14 days ago",
    "upvotes_likes": 2,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1olvgd7/best_time_to_buy_nonut_the_biggest_dip_until_now/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "NONUT"
  },
  {
    "id": 16,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "$OBEY THE VOID",
    "content": "",
    "author": "u/nemo_kilgore",
    "timestamp": "2025-11-01T14:19:11.971000+0000",
    "post_age": "15 days ago",
    "upvotes_likes": 3,
    "comment_count": 6,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1olozsh/obey_the_void/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "OBEY"
  },
  {
    "id": 21,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "What's the biggest problem with DEX trading? We're fixing it with $DZ.",
    "content": "",
    "author": "u/Pomelo_Reasonable",
    "timestamp": "2025-11-01T12:04:31.056000+0000",
    "post_age": "15 days ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1olm3v3/whats_the_biggest_problem_with_dex_trading_were/",
    "post_type": "link",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "DZ"
  },
  {
    "id": 22,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "Tired of getting front-run on every trade? $DZ Dragon Zenith has the solution.",
    "content": "",
    "author": "u/Pomelo_Reasonable",
    "timestamp": "2025-11-01T12:01:39.828000+0000",
    "post_age": "15 days ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1olm1wx/tired_of_getting_frontrun_on_every_trade_dz/",
    "post_type": "link",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "DZ"
  },
  {
    "id": 30,
    "source": "r/pumpfun",
    "platform": "reddit",
    "title": "Welcome to $BRUH, bruh.",
    "content": "We’ve all had those moments where life hits you with a solid “bruh.”Now imagine capturing that universal emotion on-chain. That’s exactly what Bruh Coin ($BRUH) is about — a community-powered meme coin that embodies the internet’s most relatable reaction.\n    \n      But here’s the twist — it’s not just another meme coin.The community behind $BRUH isn’t trying to overpromise or overhype. There’s no 50-page whitepaper, no fake “next big thing” talk. It’s about raw internet culture, vibes, and the collective power of people who just get it.\n    \n      We’re building a space where the “bruh” moment becomes a symbol for laughing at the chaos of crypto itself. Markets dump? Bruh.Gas fees spike? Bruh.You bought the top again? Yeah… bruh.\n    \n      If you understand the meme, you’re already part of the movement.\n    \n      Join the community:🐦 Twitter Community – https://x.com/i/communities/1983836893935505732",
    "author": "u/NotBleep69",
    "timestamp": "2025-10-31T17:55:46.077000+0000",
    "post_age": "15 days ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/pumpfun/comments/1ol1isc/welcome_to_bruh_bruh/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "BRUH"
  },
  {
    "id": 35,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Have you checked the new landing page on the $VOOZ website?",
    "content": "",
    "author": "u/[deleted]",
    "timestamp": "2025-09-08T17:00:02.245000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 4,
    "comment_count": 8,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Smart guys do not fade $Vooz",
      "good going vooz 🚀🚀🚀",
      "If you are tired of gambles, buy good utility coins like $Vooz and hold",
      "Doxxed team, strong utility with real users and an active community. Vooz or loosseee 🔥",
      "Never fading $Vooz!",
      "Vooz proves with every update why it's my conviction play ❤️",
      "Only coin under 1m to have its own video chat app, own merch and doxxed team. 650k is free entry!",
      "This is one of many proof that the VOOZ team is doing the serious thing. Also besides all weekly updates they are always available for questions and answers. \n    \n      This project is 100% real and rock solid, you don't have to search for any other project, get a nice bag and you will be profitable in no time."
    ],
    "link": "https://www.reddit.com/r/altcoin/comments/1nbt9t3/have_you_checked_the_new_landing_page_on_the_vooz/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 38,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$VOOZ team did its first $VOOZ buyback today worth 838$!",
    "content": "",
    "author": "u/[deleted]",
    "timestamp": "2025-09-08T04:53:27.952000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 5,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Again people, talking about the real deal and 100% transparency, that is what VOOZ is!! \n    \n      The only utility token on Solana with a 100% real usercase.\n    \n      Load up on this sendor and you will end up rich, that is a promise!!"
    ],
    "link": "https://www.reddit.com/r/altcoin/comments/1nber5y/vooz_team_did_its_first_vooz_buyback_today_worth/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 42,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$VOOZ explained by the founders!",
    "content": "",
    "author": "u/[deleted]",
    "timestamp": "2025-09-07T09:47:00.295000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 4,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1nap4wf/vooz_explained_by_the_founders/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 45,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Watching $PTB Shape Into Something Interesting",
    "content": "Over time I have learned that the way I approach tokens keeps changing. At first, I was only focused on the price chart, trying to catch entries and exits. But lately, I have started to notice how some projects push me to think a bit wider, not just about what I can make from a trade but also how I can position myself while things are still forming.\n    \n      That’s how I’ve been looking at $PTB. When it launched I didn’t pay it much mind beyond curiosity. But as I kept checking the numbers, the picture started to shift. I saw it closing a day with a price around $0.0256, and now it’s sitting around $0.0537.  a 109% move already, and even though numbers on their own don’t tell the full story, they do have a way of catching my attention.\n    \n      The other layer is the launchpool on bitget, where the APR has been holding above 50%. And that creates a different kind of thinking. It is not just about watching if the chart can push higher, but also about how I can make use of the staking side while keeping exposure. That balance between trading for quick gains and letting tokens work in the background is something I’ve been experimenting with more often, and $PTB fits neatly into that.\n    \n      It reminds me that trading isn’t static. One token can change how I look at my activities, forcing me to adapt. It might be early still, but moments like this show me why I keep paying close attention. Sometimes the story is in the chart, sometimes it is in the opportunities built around it, and when both come together, it becomes harder to ignore.\n    \n      https://www.coingecko.com/en/coins/portal-to-bitcoin",
    "author": "u/Feisty-Rhubarb-6718",
    "timestamp": "2025-09-06T17:29:58.417000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1na5fy9/watching_ptb_shape_into_something_interesting/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "PTB"
  },
  {
    "id": 48,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Latest updates on $VOOZ and next plans!",
    "content": "",
    "author": "u/[deleted]",
    "timestamp": "2025-09-06T09:01:23.020000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 3,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n9utj2/latest_updates_on_vooz_and_next_plans/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 51,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$BOOST Ecosystem Expands With CEX Listings: Thoughts?",
    "content": "Been keeping an eye on $BOOST since it started gaining traction through Alphabot and its expansion into Boostgg and Pulse. The whole “one token, three platforms” model is interesting since they’re leaning heavily into engagement tools (raffles, campaigns, info distribution) that already have millions of users.\n    \n      What caught my attention recently is the CEX activity around it. Bitget just listed $BOOST with a CandyBomb reward pool (over 8M tokens in total), and there’s been momentum from other exchanges too. Historically, Bitget’s early listings have seen some strong post-listing performance, which is worth watching if you’re into trading new markets.\n    \n      CMC link: https://coinmarketcap.com/currencies/boost-gg/#About\n    \n      Curious how others here view it...",
    "author": "u/Intelligent_Way_9450",
    "timestamp": "2025-09-05T13:45:17.661000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n95p27/boost_ecosystem_expands_with_cex_listings_thoughts/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "BOOST"
  },
  {
    "id": 55,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "New landing page with a 100% performance score is now live on the $VOOZ website!",
    "content": "",
    "author": "u/Early-Biscotti-6100",
    "timestamp": "2025-09-05T07:55:17.558000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 3,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n8z5u8/new_landing_page_with_a_100_performance_score_is/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 57,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "$VOOZ is gonna release its unmoderated clone in the next few weeks!",
    "content": "",
    "author": "u/ItsJM_",
    "timestamp": "2025-09-04T18:03:23.075000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 6,
    "comment_count": 21,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1n8hgf4/vooz_is_gonna_release_its_unmoderated_clone_in/",
    "post_type": "video",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "VOOZ"
  },
  {
    "id": 68,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "I Called $LAB Two Days Ago… Now It’s Turning Into The Biggest Story Of 2025",
    "content": "Not gonna lie, I knew this one was going to be special — but even I didn’t expect $LAB to blow up like this.\n    \n      Just two days ago, I posted about how LAB’s fundamentals, on-chain volume, and insane community engagement were signaling something big. Fast forward to today, and it’s officially the talk of the entire crypto market.\n    \n      ✅ Trending #1 everywhere:\n    \n        \n      \n      Binance Wallet #1\n    \n    \n      \n      CoinMarketCap & CoinGecko (top trending token for 3 straight days)\n    \n    \n      \n      DEXTools & DexScreener (top-trending pair by volume and watchlists)\n    \n    \n      \n      Twitter/X, Telegram, and every major trading community — everyone’s talking about it\n    \n      But here’s where things get really crazy — $LAB just completed $2.5M worth of on-chain buybacks, and there’s another $2M+ still queued from their revenue wallet for upcoming rounds.\n    \n      Their daily revenue is going parabolic, and 80% of that revenue goes straight back into buybacks, burns, and rewards. That means constant buy pressure. Every single day.\n    \n      And the best part?You can literally see every buyback live on-chain. Zero smoke and mirrors — total transparency. See this: https://x.com/lookonchain/status/1978655889788637666\n    \n      This isn’t just hype anymore — it’s execution. LAB’s model is working, and the market knows it.\n    \n      With this momentum, $LAB heading to $1 doesn’t feel like a dream — it feels like math.\n    \n      If you’re still sleeping on this, wake up. Projects like this don’t come often — AI-powered trading, cross-chain swaps, real fee revenue, and a deflationary economy all in one.\n    \n      I said it before and I’ll say it again:👉 $LAB is the story of 2025.\n    \n      Track it live:🔗 https://lab.pro🤖 @ LAB_Trading_bot\n    \n      CMC: https://coinmarketcap.com/currencies/lab/\n    \n      This isn’t financial advice — it’s just sweet, sweet validation.",
    "author": "u/Upstairs_Bet_4597",
    "timestamp": "2025-10-16T11:34:52.288000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 411,
    "comment_count": 6,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o83qau/i_called_lab_two_days_ago_now_its_turning_into/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "LAB"
  },
  {
    "id": 72,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "$OBEY is HERE!",
    "content": "330 million light-years across, and it contains 60 galaxies, ‘’The Great Nothing’’ lies about 700 million light-years from Earth. And it is just one of the voids in this universe.\n    \n      For months, we’ve been waiting for this moment\n    \n      A moment where we can finally show our faces from the shadows\n    \n      For months, we have been building silently, lurking from one community to another, and building things up to ensure that everything will go well as we jump to the VOID.\n    \n      As we jump all together, nothingness continues to expand. Feeding the Hungry void, as it will eventually suck everything out from this point.\n    \n      Three communities have already been consumed, both are well-known projects, SmallPipi, Plath and the Pasta Chain.\n    \n      Both are built by reliable DEVs, and they have decided to join forces to build something better, which is $OBEY\n    \n      $OBEY as we will take over communities who are struggling to push their token up, whether it be a CTO or a struggling project, we are here to save you\n    \n      $OBEY as everyone will soon recognize us, not just for the utilities but also for the relentless community behind it.\n    \n      $OBEY as we will continue to expand, and grow further just like how the VOID continues to consume while the Universe continues to expand.\n    \n      This is a safe place for you, we welcome everyone here, may it be a Small project or a Big one, Your voice matters to us.\n    \n      Join us, You’re not alone. Come offer yourself, we have something in store for you\n    \n      TG: @TheVoidIsEverywhere",
    "author": "u/Kryvenishere",
    "timestamp": "2025-10-15T23:11:54.388000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 18,
    "comment_count": 24,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o7qb4s/obey_is_here/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "OBEY"
  },
  {
    "id": 75,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "The $HUNT Pulse Engine - The reignition",
    "content": "Every hunt has a heartbeat. Ours just started racing again.\n    \n      That heartbeat has always been there in $HUNT, the flow between holders, the games, the community and the rewards. It’s what keeps the project alive. And now, it’s building again.\n    \n      What “The Pulse” Really MeansWhen we talk about The Pulse, we’re talking about the loop that feeds everything.Holders get paid. Players earn. Activity fuels engagement.\n    \n      It’s simple: the more we move, the stronger the system gets and the stronger the system gets, the more it gives back.\n    \n      We’ve already paid out millions in $HUNT and tens of thousands in SOL through rewards, lotteries, and games. That’s not theory,  that’s proof. The Pulse is real, and it’s alive because the Pack keeps it fed.\n    \n      We’ve stabilized the base: LP steady, listings solid, content rolling. Now comes the push outward.\n    \n      We’re bringing the fun back to the front; the competitions, the engagement, the connection.This next stretch is about reminding everyone that $HUNT is an active ecosystem with movement, rewards and an awesome culture.\n    \n      The earning loop is real.The Pulse is strong.And it’s only getting faster from here.\n    \n      Stay alert.\n    \n      Next week, new games begin 👀👀\n    \n      CA: HUNT4B1dJWqTm7aZCqjUW6L3KAcEoZwqedf9eknLKWrx\n    \n      More info: http://linktr.ee/hunt_on_sol",
    "author": "u/NieRaus",
    "timestamp": "2025-10-15T21:26:22.239000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 35,
    "comment_count": 24,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o7nqqf/the_hunt_pulse_engine_the_reignition/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "HUNT"
  },
  {
    "id": 81,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "PENGUINA | The Girlfriend That Charms Web3 | 0% Tax | 1B Supply • 8-Stage Presale • Locked Liquidity | 5-10% APY Staking • SolidProof Audit | Join the $888K Giveaway and Earn with the Cutest DeFi Queen!",
    "content": "Penguina: The Girlfriend That Charms Web3 — and Means Business\n      In a market crowded with recycled memes and short-lived trends, Penguina emerges as a refreshing symbol of creativity, utility, and emotional connection. She’s not just a cute penguin — she’s Pengu’s girlfriend, the next evolutionary step in the “Pengu” universe. But beyond her charming image lies a serious ecosystem designed for sustainability, rewards, and community-driven growth.\n    The Story Behind Penguina\n      Penguina was born out of the idea that blockchain projects can have personality without losing purpose. In Web3, where most tokens chase speculation, Penguina fuses narrative and function. She represents warmth and community — but she also delivers performance through her built-in trading tool and structured tokenomics.\n    \n      By positioning itself as both a meme and a movement, the $PENGUINA token is bridging emotional engagement with real token utility. This is where charm meets smart DeFi engineering.\n    Ecosystem and Utility\n      The Penguina ecosystem extends beyond memes and aesthetics. The project integrates a magic trading tool that empowers holders to interact with DeFi markets more intelligently. With staking options offering 5–10% APY, referral rewards, and NFT integrations, Penguina builds an interactive economy that rewards both participation and loyalty.\n    \n      Through its multi-phase roadmap, the project also plans DeFi portal expansion, NFT collections featuring Pengu & Penguina, and ecosystem-level integrations across major chains including ETH, BNB, SOL, and BASE.\n    Presale Momentum and Growth\n      Currently in Stage 1 of its presale, Penguina has already raised over $480,000 of its $500,000 goal, signaling strong early traction. Tokens are available through ETH, USDT, and card purchases directly via web, audited by SolidProof and verified for transparency.\n    \n      Early participants benefit from tiered pricing that anticipates a 700% increase by listing, with upcoming launches on Uniswap and MEXC. The entry barrier remains low (minimum $10), ensuring accessibility while maintaining upward scalability for larger investors.\n    Tokenomics and Governance\n      With a total supply of 1 billion $PENGUINA tokens, the allocation model balances accessibility, security, and long-term development:\n    \n        \n      \n      Public Sale (26%) — 8-stage presale structure on web\n    \n    \n      \n      Liquidity Pool (20%) — locked for 18 months via Unicrypt\n    \n    \n      \n      Team (15%) — locked for 24 months with monthly vesting\n    \n    \n      \n      Marketing & Community (15%) — supports campaigns, giveaways, and events\n    \n    \n      \n      Treasury/Development (16%) — secured through multi-sig governance\n    \n    \n      \n      Staking & Rewards (8%) — funding community rewards and incentive programs\n    \n    \n      \n      The design prioritizes ecosystem stability and progressive decentralization, ensuring sustainable token flow and transparent treasury management.\n    Roadmap: From Launch to Domination\n      Penguina’s roadmap outlines a clear trajectory across three distinct phases:\n    \n      Phase 1 — Launch: Token deployment, community formation, initial marketing, and DEX listings.Phase 2 — Growth: Major CEX listings, strategic partnerships, NFT collection release, and global marketing expansion.Phase 3 — Domination: Full ecosystem development, DeFi portal integration, utility expansion, and broad global adoption.\n    \n      Each phase reflects calculated growth, supported by locked liquidity and consistent developer engagement.\n    Community Power and Exclusive Perks\n      Community is at the heart of Penguina’s strategy. Holders gain access to a wide array of incentives:\n    \n        \n      \n      Top 25 holders receive lifetime Portal access and elite Penguina NFTs.\n    \n    \n      \n      Holders of 1M+ tokens get 20% discounts on Portal fees.\n    \n    \n      \n      All holders benefit from referral bonuses and staking yields up to 10%.\n    \n    \n      \n      888K $PENGUINA giveaway rewards active participation and engagement.\n    \n    \n      \n      This gamified incentive structure creates a self-sustaining ecosystem where loyalty is directly rewarded, turning passive holders into active contributors.\n    The Future of Meme Utility\n      Penguina is redefining what it means to be a meme coin in 2025. With a solid foundation of tokenomics, DeFi integration, and storytelling, it positions itself as more than a short-term speculative play. It’s a blend of emotion, design, and economics — wrapped in a lovable Web3 identity.\n    \n      As the presale nears completion, the message is clear: Penguina is where community charm meets crypto intelligence.\n    \n      All Link: https://linktr.ee/Penguinaofficial",
    "author": "u/Local_nut07",
    "timestamp": "2025-10-15T17:05:28.564000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 161,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o7gsa5/penguina_the_girlfriend_that_charms_web3_0_tax_1b/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "888K"
  },
  {
    "id": 84,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "$SHAFT w Howard Krieger. We are SO back.",
    "content": "Howard headed $ersdl which became a top 100 project with around $800m mcap a few years ago. He is back with a new project and doxxed team called $SHAFT foundation, focused on funding accessible AI, adaptive robotics, and embodied intelligence. Real tangible IRL product!\n    \n      -$SHAFT: STRATEGIC HUB FOR AI FOCUSED TECHNOLOGY\n    \n      -DOXXED TEAM: CEO Howard Krieger worked as a valuation expert with HSBC and Wells Fargo. The entire team is doxxed and their bios are on the website. They are very interactive- AMA today on X and daily chats in the telegram ShaftFoundation\n    \n      -NOT VAPORWARE- they are focused on real tangible product and currently have an AI based X video-language dubbing software complete and operable, and are working toward even more.\n    \n      -1 billion tokens based on SOL and just bridged to BSC, soon to BASE. Micro cap right now guaranteed to continue building IRL product and increasing mcap Join the X spaces AMA at 12pm EST to learn more and hear from the doxxed team @shaftfinance\n    \n      See you there! To the moon!",
    "author": "u/Dean_McCool",
    "timestamp": "2025-10-15T15:40:27.434000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 2,
    "comment_count": 3,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o7eh8l/shaft_w_howard_krieger_we_are_so_back/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": "SHAFT"
  },
  {
    "id": 60,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "We burn it as GOLD rises!",
    "content": "As we speak right now, the crypto market is down, but Gold keeps going up!\n    \n      We have a solution for it! We’re introducing Fiat x GOLD! Every time GOLD rises up the DEV keeps burning the supply!\n    \n      I shilled this while it was still at 40k MCAP, and now it’s holding well, and it is now at 100k MCAP, and we’re not planning to stop there!\n    \n      It also incentivizes holders, as airdrops will happen every Sunday for those who held during the week, and a lot more is coming for us!\n    \n      Art, listings, and more utilities are coming up for this project, so you'd better not miss this out! It is not too late to join us for our cause!\n    \n      Hedge your portfolio with this coin! Every time GOLD goes up, we burn the supply forever!\n    \n      How does it work? Let’s say a 2% rise in gold price would trigger a 2% burn of token supply, which will come from the Developers' wallet and some buybacks! This idea itself creates scarcity, just like real gold, potentially driving price appreciation in an organic way!\n    \n      And not just that! We’re also planning to bridge it with Ethereum, so once you see this, don’t tell me I didn’t offer this to you at 100k MCAP, remember it was only at 40K yesterday, what more tomorrow?\n    \n      Check us out!\n    \n      Telegram: @fiatxgoldchat\n    \n      Website: https://fiatxgold(dot)com\n    \n      CA: GcS9LAZNxnYzxqwUQaaaY8pXeTQ5CLgDbHJ9wGqo59UR",
    "author": "u/Juggernaut98503",
    "timestamp": "2025-10-16T19:34:20.191000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 5,
    "comment_count": 4,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "Gold will always be gold... and this is a gold ticker!!",
      "Interesting project",
      "Lest go this gold"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o8fw95/we_burn_it_as_gold_rises/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 36,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Looking at Altcoins Beyond Charts",
    "content": "I’ve been thinking a lot about how I approach altcoins lately. Before I always kept it on charts, watching candles and lines moving in different directions, but for now it’s more layered than that. The moments that stand out are when I stumble across something unexpected, like when I saw a new listing tied to real-world assets. At first glance, it was just another ticker, but then I realized it was linked to collectibles from one of the biggest global franchises. That got my attention. I didn’t rush in with size tho, just tested with a small position, and before long it had doubled. That feeling of finding something off the usual path is what keeps me searching. And made me think outside the box.\n    \n      I saw some events featuring that particular token running on platforms too, just like the Phase 17 Challenge running on bitget right now, talking about different tokens. The pulled in mix of, $CARDS, $TROLL, $PUMP, $KOGE, $USDU, all with different flavors. Some are pure meme energy, others lean into stable mechanics. On the surface, it’s framed around rewards, 100,000 BGB waiting for whoever comes out on top, but I look at it differently. It’s a live space to push strategies, test how I handle shifts, and see which ideas actually hold when the tokens move in different directions which is looking beyond the charts and even scouting other different methods to improve portfolio and gain more from it.\n    \n      https://coinmarketcap.com/currencies/collector-crypt",
    "author": "u/Fit_Negotiation_1207",
    "timestamp": "2025-09-08T16:10:39.312000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "100k BGB is massive, I am definitely going to join this, I have joined few challenges on bitget back then and it turns out amazing, Hopefully i am not late on this"
    ],
    "link": "https://www.reddit.com/r/altcoin/comments/1nbrxz9/looking_at_altcoins_beyond_charts/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 61,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "A coup has happened while you were not paying attention",
    "content": "A small coup once took place in Ethereum’s early days — not a fork or governance vote, but a literal on-chain takeover between some of its founders. Back in 2016, Alex Van de Sande (Avsa) launched a joke token called Unicorn Meat, poking fun at Ethereum’s unicorn mascot by tokenizing “grinded unicorns.” It started as an April Fool’s experiment, but like many things in early Ethereum, it accidentally became something more — one of the first DAO-style experiments and possibly the first trustless token swap ever.\n    \n      Members of the “Unicorn Meat Association” could make proposals, vote, and even seize control of the contract. That’s exactly what happened when Piper Merriam, another core Ethereum dev, staged an on-chain coup and took ownership from Avsa. Vitalik even interacted with the contract himself. It was playful, chaotic, and years ahead of its time — a few months later, the real DAO hack would happen, but Unicorn Meat had already lived the prototype version of that story.\n    \n      Now, almost a decade later, the contract has been revived in the same spirit — through another coup. Unicorn Meat is back, tradable again and now live on Base, where Ethereum’s past meets its future. It’s the only memecoin ever created by Ethereum Foundation devs, and a genuine piece of on-chain history.\n    \n      If you appreciate old contracts, early Ethereum culture, or just good blockchain stories — this one’s worth biting into. Become a carnivore. 🥩",
    "author": "u/x_mgc",
    "timestamp": "2025-10-16T16:31:26.719000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o8awrr/a_coup_has_happened_while_you_were_not_paying/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 37,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "401jK - Meme is becoming reality. Are you ready, anon? - 401jK",
    "content": "",
    "author": "u/kamikaze_punk",
    "timestamp": "2025-09-08T08:48:17.141000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 12,
    "comment_count": 6,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Ready to roll!",
      "MidweekskiVT • 2mo ago All in",
      "Spx6900 of Solana. Y'all are so early\n    \n      And it's a great meme making fun of the system",
      "I think sooo!\n    \n      I can feel it\n    \n      401jk",
      "This gonna go hard",
      "Let fucking go!!!!!"
    ],
    "link": "https://www.reddit.com/r/altcoin/comments/1nbihtp/401jk_meme_is_becoming_reality_are_you_ready_anon/",
    "post_type": "gallery",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 62,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Vooz is the real one!",
    "content": "We got a lot of Omegle variants in the market. They just tweak the word Omegle and launch the same stuff again and again. Bored of it right? Try Vooz.\n    \n      Vooz is an anonymous video chat platform too like Omegle, where you can meet and have a fun time with random strangers through video or text chat. You can even make new friends and save them in your friendlist to connect again later. We also got group text chatrooms. Unlike Omegle, Vooz is moderated, and you can't escape our AI filters if you are doing obscene stuff. We got gender and location filters, an unmoderated Vooz clone and lots of other monetized features coming on the site.\n    \n      But what makes us different from the other Omegle dupes? We are the only anonymous chat platform to have a Web3 presence. Vooz got its own token called $Vooz which released on Solana 3 months ago, and is now trading at 300k mcap. The real diamond hands still remain. If you are a $Vooz holder you can grab premium features on the site at a 50% discount compared to fiat payments. Also we burnt 1m tokens already, and 1300$ worth vooz bought back.\n    \n      In the coming weeks, Vooz will be the only video chat site in the anonymous space to have group hangouts. Hangouts are fun rooms where users can join randomly and chill together. Anyone can create a hangout and others can join it. There will be a lot of hangout rooms on the site based on various topics. Users can join whichever they want. They can also gift stuff to the hangout organiser. Overall super fun.\n    \n      Join our socials and chill with us!\n    \n      https://linktr.ee/clubvooz\n    \n      Vooz sub: r/Vooz\n    \n      CA: vooz4rKUS7PJ2a1r1T3q81E7b5NpGYjsT5YxciCJ4rF\n    \n      CMC: https://coinmarketcap.com/currencies/vooz-coin/",
    "author": "u/Early-Biscotti-6100",
    "timestamp": "2025-10-16T15:57:26.506000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 7,
    "comment_count": 9,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "My reasons on why Vooz is the best buy this season.\n    \n      Doxxed founders, utility live for 10 months, token been through all ups and downs and still holding good, core community holding strong, new updates coming every week on the platform, buybacks and burne every week. Pure bullishness!!",
      "Very well said",
      "Vooozz or loozeee!!",
      "Holding my bags with conviction! 🚀",
      "Like a chad 🔥",
      "They just changed some letters of Omegle lol. Source code is same. That's not how you build something unique",
      "The best utility out there: VOOZ",
      "This is the umpteenth time am seeing VOOZ, what am I missing on it"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o89zxt/vooz_is_the_real_one/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 39,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Back to Genesis Explained: Why Asset Lineage Matters in Blockchains and Finance",
    "content": "",
    "author": "u/No-Cookie9107",
    "timestamp": "2025-09-07T18:37:27.332000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 0,
    "share_count": 0,
    "award_count": 0,
    "comments": [],
    "link": "https://www.reddit.com/r/altcoin/comments/1nb128q/back_to_genesis_explained_why_asset_lineage/",
    "post_type": "crosspost",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 63,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Biokript Pro: A Microsoft-Backed DeFi Project Focused on Stop-Loss and Rug-Pull Protection on Solana.",
    "content": "Lately there’s been a lot of talk about how DeFi needs more protection for everyday traders. After the recent market crash and a few high-profile rug pulls, many traders lost funds due to forced liquidations or unverified liquidity pools.\n    \n      That’s why I’ve been following Biokript Pro, a new project built on Solana that’s taking a more structural approach to risk management instead of chasing hype. It’s reportedly part of the Microsoft for Startups program and built on Azure infrastructure, which gives it some extra credibility on the tech side.\n    \n      From what I’ve read, the platform is aiming to combine speed and safety with features such as:\n    \n      • Patented rug-pull protection to monitor liquidity in real time\n    \n      • Native stop-loss tools directly on-chain\n    \n      • Low 0.1 percent trading fees, about 10× lower than several current Solana DEXs\n    \n      • Profit-sharing model where token holders receive part of trading fees\n    \n      • Fully doxxed team of seven people based in the United States and Bosnia Unlike most leveraged DEXs, Biokript Pro focuses only on spot trading, so users can’t be liquidated due to leverage swings.\n    \n      The concept of a patented protection system in DeFi is interesting, especially if it works as intended on Solana’s infrastructure. It’s rare to see that level of transparency this early in a project.\n    \n      If you want to read more, the team’s site is\n    \n      https://biokript.com\n    \n      What do you think about the idea of patented on-chain safety mechanisms in DeFi? Could this approach become standard in future exchanges, or will decentralized traders prefer full self-risk?",
    "author": "u/Yawnie2",
    "timestamp": "2025-10-16T15:25:29.424000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 358,
    "comment_count": 4,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "Be careful. There is no evidence that they are actually a Microsoft partner anywhere other than on the Biokript website, which can’t be verified.",
      "0.1 % fees and profit sharing sound almost too good to be true. How sustainable is that long-term? Are those profits coming from volume, or is there another mechanism to support payouts to holders?",
      "Finally, someone’s addressing the rug-pull nightmare on Solana. If this really works the way it’s described, Microsoft-backed, patented protection, and stop-loss built in — this could be a game-changer for DeFi safety. I’m watching this closely."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o8957f/biokript_pro_a_microsoftbacked_defi_project/",
    "post_type": "multi_media",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 40,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "401jK - This might possibly go down as the hardest vid in meme-coin history. Retirement is Imminent. Socials below. - 401jK",
    "content": "",
    "author": "u/kamikaze_punk",
    "timestamp": "2025-09-07T17:44:08.865000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 14,
    "comment_count": 5,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "MMB knows what he is talking about.\n    \n      Mind blowing opportunity at these levels.\n    \n      401jk is shooting for deca millions easily.\n    \n      @401_JK\n    \n      Cz7LGKdZPpAxonXx23ZYPW3RtDQvjcf17ZDCZEzFpump",
      "The content your community puts out is unbelievable!!!! I've rotated my 401k to 401jK!!!",
      "This gonna send too hard",
      "MidweekskiVT • 2mo ago All in",
      "Tall_Run_2814 • 2mo ago 🚀🚀🚀"
    ],
    "link": "https://www.reddit.com/r/altcoin/comments/1naznjq/401jk_this_might_possibly_go_down_as_the_hardest/",
    "post_type": "video",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 64,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Could Hexydog Become 2025’s Most Practical Crypto Presale?",
    "content": "The 2025 crypto presale scene has been full of ambitious promises, but not many projects manage to combine utility with genuine purpose. While meme coins still attract plenty of attention, many investors are beginning to look for something more grounded. One project standing out in that space is Hexydog ($HEXY) — a presale that connects blockchain technology with the $250 billion global pet care market.\n    \n      Hexydog’s concept is simple but surprisingly relevant. It aims to make crypto useful for everyday pet-related expenses through HexyPay, a multi-chain payment system that lets users pay for things like vet visits, grooming, or pet supplies. That real-world connection gives the project a use case beyond speculation — something many presales lack.\n    \n      From a structural point of view, Hexydog’s tokenomics also seem well thought out. The total supply is capped at 20 billion tokens, with 25% dedicated to staking rewards offering around 130-180% APY. The team plans to burn 50% of unsold presale tokens at launch, introducing a deflationary element that could help stabilize long-term value.\n    \n      Security and transparency are key focuses too. The project has completed a SolidProof audit, the team is KYC verified, and mechanisms are in place to prevent large holders from manipulating the market. Hexydog also runs across Ethereum, BNB Chain, and Solana, expanding accessibility for investors who prefer different ecosystems.\n    \n      Beyond the technical side, Hexydog’s team has been active in the blockchain community, participating in events and earning attention from influencers such as James Pelton, a well-known YouTuber who reviewed the project earlier this year.\n    \n      Whether Hexydog becomes a major player in 2025 remains to be seen, but it represents a shift toward practical, transparent, and purpose-driven crypto presales. For investors tired of empty hype, it’s a reminder that innovation in crypto doesn’t have to be complicated — sometimes it just needs to make sense",
    "author": "u/Educational_Base_301",
    "timestamp": "2025-10-16T14:49:25.861000+0000",
    "post_age": "1 mo. ago",
    "upvotes_likes": 1,
    "comment_count": 1,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1o88729/could_hexydog_become_2025s_most_practical_crypto/",
    "post_type": "text",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  },
  {
    "id": 41,
    "source": "r/altcoin",
    "platform": "reddit",
    "title": "Crypto finally got creamy",
    "content": "",
    "author": "u/Ok_Poem_2813",
    "timestamp": "2025-09-07T16:54:17.566000+0000",
    "post_age": "2 mo. ago",
    "upvotes_likes": 4,
    "comment_count": 2,
    "share_count": 0,
    "award_count": 0,
    "comments": [
      "Digital milk supremacy. RAWW about to lacto-overflow",
      "The Telegram bot is too smart, man. Asked it one milk fact and now I know more about cows than my biology teacher ever taught me"
    ],
    "link": "https://www.reddit.com/r/altcoin/comments/1nayd7x/crypto_finally_got_creamy/",
    "post_type": "image",
    "screenshot_path": null,
    "sentiment_score": null,
    "hype_score": null,
    "keywords_found": [],
    "token_name": null
  }
]