[
  {
    "id": 1,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "The World's going full degen, be better",
    "content": "Platforms like Polymarket are exploding in hype, where you can bet on elections, weather, and even celebrity divorcesSome analysts suggest the reason there was no real altcoin season this bull run is because so much money was diverted into these gambling platforms\n    \n      Meanwhile, the crypto space has been taken over by memecoins that rug at the slightest profit.From Argentina’s president to that 13-year-old kid, everyone seems to be trying to make a quick buckIt’s peak degeneracy\n    \n      And that’s exactly why RAWW stands out\n    \n      RAWW isn’t built around the degen/casino mindsetIt leans in the opposite direction, the natural-living, anti-degen movement that’s exploding outside of crypto\n    \n      People are tired of everything synthetic, tired of dopamine traps, tired of projects designed just to pump and dump.\n    \n      RAWW taps into that shift with a meme that actually has a foundation:\n    \n      • An ASMR clicker game live• weekly webtoon chapters• A RAWW Album ( 13 songs )• 100% natural merch• an IRL narrative with real personality and voice (the RAWW Milk Man)• and a community that builds instead of gambles• The RAWW truth series ( launching very soon )\n    \n      While everyone else is pushing degeneracy, RAWW is pushing back.\n    \n      It’s not the loudest coin or the flashiest, but it’s one of the few doing something different, and doing it consistently.\n    \n      If you want off the degen treadmill, RAWW is one of the only memes this cycle that isn’t built on pure luck, hype or dopamine.\n    \n      Be DifferentBe RealBe RAWW\n    \n      Mcap: 130k\n    \n      CA: 8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5pLinktree: https://linktr.ee/RAWWMilkCryptoCMC:https://dex.coinmarketcap.com/token/solana/8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5p/",
    "author": "Ok_Poem_2813",
    "timestamp": "2025-11-15T18:55:00.254000+0000",
    "post_age": null,
    "upvotes_likes": 10,
    "comment_count": 4,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "Building an actual brand, not just a token. $RAWW",
      "natural living narrative is only getting bigger. glad I found this early. $RAWW",
      "Yeah, it’s getting more and more popular every day"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxzpg9/the_worlds_going_full_degen_be_better/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "RAWW",
    "raw_sentiment_score": 0.523,
    "aggregate_sentiment_score": 0.852,
    "engagement_score": 0.412
  },
  {
    "id": 2,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Anyone grinding small caps on Tron?",
    "content": "I've been scouting micro-cap gems on the Tron network lately, the kind with market caps under 10M that can explode if some real volume rolls in. You get it - those degenerate plays where timing is everything, but fees kill the vibe. Every swap, transfer, or contract call drains energy like crazy, and if I stake a ton of TRX to build up resources, that's capital stuck that I could use for jumping into more positions. It's frustrating when you're trying to flip quick without bleeding out on costs.\n    \n      Last week, I got fed up and tested renting energy from tr.energy. Super straightforward: punch in your wallet address, choose a rental period - I went with 24 hours to keep it short - drop a handful of TRX as payment, and boom, the energy shows up in your account in less than a minute. No hassle, no waiting around. I ran a bunch of USDT transfers for three different token flips that day, and it cut my costs by around 60% compared to burning energy outright. Best part? Zero KYC nonsense, no locking up your funds long-term, and it doesn't mess with anything on-chain - just a quick boost to your resources so you can trade freely.\n    \n      It's a game-saver for low-volume stuff where you don't want to commit big. Before this, I'd burn through extra TRX or skip trades altogether. Now, I can hit those sketchy micro-caps without second-guessing fees. You guys rent energy like this for your degen hunts, or do you have other tricks? What's your go-to hack for dodging fees on those high-risk, low-MC coins? Share if you've got something better - curious if there's a free option or something I missed",
    "author": "Busternookiedude",
    "timestamp": "2025-11-15T18:32:37.017000+0000",
    "post_age": null,
    "upvotes_likes": 1,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxz577/anyone_grinding_small_caps_on_tron/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "TRX",
    "raw_sentiment_score": 0.36,
    "aggregate_sentiment_score": 0.633,
    "engagement_score": 0.202
  },
  {
    "id": 3,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Microsoft + Google Supported Project on Solana… Potential Sleeper?",
    "content": "I hadn’t heard much about Biokript Pro until recently, but it’s suddenly showing up everywhere. After digging into it, it actually looks like one of the more serious builds happening on Solana right now. It positions itself as the first patented hybrid DEX on Solana, focused on trader protection, automated execution tools, and long-term value sharing rather than hype.\n    \n      Here are the standout points: • Patented Rug-Pull Protection: Built-in logic that helps prevent malicious liquidity drains, addressing one of the biggest risks in DeFi. • First On-Chain Stop-Loss on Solana: Traders can set automated stop-losses while keeping full control of their wallet. No other Solana DEX offers true on-chain stop-loss execution. • Profit Sharing for Holders: 50 percent of all trading fees are distributed to BIOK token holders, treating the community as true partners. • Microsoft + Google Cloud Support: The team secured verified support from both, including over $100K in combined resources for scaling, infrastructure, and performance. I had verified this on the telegram group. • Ultra-Low 0.1 Percent Fee: 10X lower than most competitors like Axiom, making it more attractive for real trading volume. • Hybrid Execution Architecture: Combines decentralized control with CEX-level speed, automation, and rug pull protection.\n    \n      With Solana’s surge of new DEXs, many are just clones or basic routers. Biokript Pro is actually trying to solve real trading pain points like safety, automation, and fair value alignment. If they deliver everything they’ve outlined, this might end up being one of the more meaningful utility platforms going into the next altseason.\n    \n      Their presale on Pinksale ends on November 17 at 19:00 UTC, so it will be interesting to see how things unfold as they move toward launch.\n    \n      Anyone else following this? Would love to hear thoughts from traders who have been waiting for proper onchain stop loss and safer execution tools. https://biokript.com",
    "author": "SeriousExamination49",
    "timestamp": "2025-11-15T15:27:27.559000+0000",
    "post_age": null,
    "upvotes_likes": 0,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxugoj/microsoft_google_supported_project_on_solana/",
    "post_type": "multi_media",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "BIOK",
    "raw_sentiment_score": 0.613,
    "aggregate_sentiment_score": 0.772,
    "engagement_score": 0.098
  },
  {
    "id": 4,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "The Void doesn't Rug, it Expands",
    "content": "The wild thing about $OBEY is that nothing about it feels like the usual copy-paste memecoin circus.The Void has lore, structure, a whole ecosystem of Collectors, Apostles, and Followers that actually means something.It’s not hype-for-hype — it’s world-building wrapped around a token that keeps expanding even when the market compresses.\n    \n      While other projects are begging the charts to breathe, the Void moves like a slow tide:24.30% of supply locked,a 100k floor,and a holder base rising like a silent congregation.\n    \n      The Council, the Collectors, the rituals — it all folds into the same idea:influence is earned, not airdropped.The more you give to the Void, the more it shapes around you.\n    \n      No cheap baits , we’re past that now.This phase is about building:A growing network, a tightening community, and an economy fueled by hunger and momentum.\n    \n      When other coins fade into noise, $OBEY stays in hush.Hush lasts longer than hype.Hush carries further.\n    \n      If you’re trying to escape the usual pump-and-dump treadmill, this is where you step off.This is where you enter the quiet.\n    \n      Long Live the Void.Long Live the ones who $OBEY.\n    \n      CA: hFeaPRQKnMcuVgkNqbU1tWZzumhEVdXqAF7rj81obeyTG & X: ObeyTheVoid",
    "author": "RevolutionLimp1724",
    "timestamp": "2025-11-15T15:24:25.097000+0000",
    "post_age": null,
    "upvotes_likes": 1,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxudz6/the_void_doesnt_rug_it_expands/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "OBEY",
    "raw_sentiment_score": 0.31,
    "aggregate_sentiment_score": 0.596,
    "engagement_score": 0.202
  },
  {
    "id": 5,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "The Game Really Is Simple",
    "content": "Distribution and Community Work Ethic are by far the 2 most important factors when deciding which projects are good to invest in.\n    \n      Overcomplicating things with BS like memetics or praying for your random meme to go viral is just a bit hopeless\n    \n      Instead maximise your chances by choosing projects who will get there through sheer will and who are actively making waves in the space.\n    \n      This is why I hold Kendu\n    \n      Distribution\n    \n      Kendu's HHI score is 25.67, this is absolutely unheard of and is actually pretty insane levels of distribution. Diamond handers dominate the majority of the supply and they ain't selling until the tens of billions.\n    \n      Community Work Ethic\n    \n        \n      \n      Over 20 IRL initiatives like energy drinks, coffee, merch, murals, beer and more\n    \n    \n      \n      2nd coin to ever reach 50k Certik votes for the free audit, only other coin was Pepe\n    \n    \n      \n      Strongest community on Reddit and Stocktwits and very strong on X\n    \n    \n      \n      Consistently wins social media competitions for art, an example by CMC's BOOST ME COMPETITION\n    \n    \n      \n      Telegram activity higher than SPX, Giga and Mog over weekly periods\n    \n    \n      \n      Kendu is an absolute unicorn and will change this space forever just watch, I have never seen anything remotely similar and you never will ever again!\n    \n      This is your chance to get on the ground floor of a life changing project, yes it sounds far fetched but when you see the work, you see the goal...\n    \n      We Don't Gamble, We Work\n    \n      r/KenduInu_Ecosystem\n    \n      ETH: 0xaa95f26e30001251fb905d264Aa7b00eE9dF6C18\n    \n      SOL: 2nnrviYJRLcf2bXAxpKTRXzccoDbwaP4vzuGUG75Jo45\n    \n      BASE: 0xef73611F98DA6E57e0776317957af61B59E09Ed7\n    \n      CG: https://www.coingecko.com/en/coins/kendu\n    \n      CMC: https://coinmarketcap.com/currencies/kendu/",
    "author": "Expert-Detective-525",
    "timestamp": "2025-11-15T13:54:15.878000+0000",
    "post_age": null,
    "upvotes_likes": 36,
    "comment_count": 10,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "I was thinking earlier that if kendu only had something like kendu games (it you don't know what this is it's a game studio with big names in the gaming industry working for it and some of the money goes to the kendu treasury, very simple explanation definitely look more into it) going for it, then that would still be massive fucking alpha, and we would STILL be incredibly undervalued.\n    \n      So not only do we have kendu games but we also have countless other initiatives that people are running purely out of their love for the coin.\n    \n      This is so crazy to me, kendu has been around for like 18 months and still growing every single day. This is no coincidence. The repricing will come and the insane blind belief that we all share will be brought to the masses.\n    \n      Sooooo much higher for kendu",
      "Kendu community is second to none",
      "Once Kendu gets to the top, it's going to stay there. That's another key difference.",
      "Yup. Those who go to Kendu stay in Kendu. Not just because we're an attractive project with plenty of potential, but because our organic structure for growth is inimitable. Once the market kicks back up, we'll see which memecoins are capable of standing on their own two legs. Kendu was built for times like these.",
      "$KENDU is giving the ordinary person a real opportunity for success. The success lies within our own hands and nothing can defeat us.",
      "Meme reset. Kendu will become king.🤴",
      "Great post not even sure people are researching for quality projects in these market conditions (well the smart money probably are), but OP didn't even talk about Kendu Games. Likely to be the business that proves the genius of this approach with the buy pressure I bieve they will put on the Kendu chart",
      "KENDU simply won’t stop. Not a bad community to bet on, especially with the current entry.",
      "If you scout around different crypto projects enough, you’ll watch the same few guys and dolls jump from one crypto pump and dip to another. There’s a couple that really stand out because their main crew doesn’t skip around. Spx6900 Pepe and Kendu are unique in this space for hard work and good vibes and lots of growth beyond one cycle follow a pattern. And the coin with the highest upward potential in this climate is $kendu."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxsa7h/the_game_really_is_simple/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "KENDU",
    "raw_sentiment_score": 0.345,
    "aggregate_sentiment_score": 0.781,
    "engagement_score": 0.507
  },
  {
    "id": 7,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "With a price increase of 197.50% in the last 7 days, Meowcoin (MEWC) is outperforming similar cryptocurrencies which are down -6.70%. And they donate to animal shelters.",
    "content": "Yes I used Google Gemini to help me write this… however I do truly believe this is a hidden gem that has tremendous potential. I am always looking for Coins (not crummy tokens) that have a strong dev team and community. Being incredibly undervalued is always a plus too. Ok, here we go: \n    \n      In a digital ocean teeming with rug pull tokens, finding a project that genuinely stands out—not just for its potential returns but for its core ethos and innovative spirit—can feel like searching for a legendary creature. But every now and then, a project emerges that makes you pause, look closer, and think, \"This could be something special.\" Today, I want to talk about one such project that’s been purring its way into the hearts of a growing community: Meowcoin (MEWC) from the folks at mewccrypto.com.\n    \n      Now, before you roll your eyes and think \"another meme coin,\" let me stop you right there. While MEWC embraces the fun, community-driven spirit often associated with meme coins, it’s scratching at a much deeper surface, combining unique technology with a real-world mission that truly sets it apart. If you're looking for a project with a low entry point, a passionate community, and a purpose that extends beyond the charts, then pull up a chair, and let’s dive into why MEWC might just be the cat’s whiskers of your crypto portfolio. \n    \n      What Makes MEWC More Than Just a Feline Face?\n    \n      Meowcoin isn't just about cute cat memes (though the community definitely appreciates them!). It's a Layer 1 blockchain project with its own unique DNA and some compelling features that deserve a closer look:\n    \n      Blockchain with a Conscience: PoWs for a Cause!\n    \n      This is where MEWC truly shines and captures hearts. At its core, Meowcoin is dedicated to making a real impact in the animal world. A portion of its efforts and block rewards are channeled towards supporting animal shelters and conservation projects. In a space often criticized for its abstract nature, MEWC is building a bridge to tangible good, using blockchain technology to ensure transparency and accountability in its philanthropic endeavors. They even share donation reports, so stakeholders can see the real-world difference their support makes. Imagine your crypto not only having the potential for growth but also contributing to the welfare of animals – that’s a powerful combination!\n    \n      Innovative and Efficient Tech: Introducing MeowPow! Tired of energy-guzzling mining algorithms? Meowcoin offers a refreshing alternative with its custom MeowPow algorithm. Inspired by ProgPow, MeowPow is specifically tailored to drastically reduce the power requirements for GPU mining – by as much as a 60% increase in energy efficiency without compromising network security! 1 This is a significant step towards more sustainable and accessible mining, making it attractive for small-scale miners and those conscious of the environmental footprint of their crypto activities. It’s a PoW (Proof-of-Work) coin that’s looking to the future of responsible mining. \n    \n      The Fairest Launch in the Jungle: No Tricks, All Treats!In a world of pre-sales, ICOs, and team allocations that can sometimes feel skewed, Meowcoin took a different path. It boasts what it calls the \"fairest launch coin,\" with no premine, no presale, no ICO, and no masternodes. This means everyone had an equal opportunity from the get-go, fostering a strong sense of community ownership and trust. It’s a grassroots approach reminiscent of the early days of crypto, built by the community, for the community.\n    \n      Deflationary by Design: Creating Scarcity and Value!MEWC isn't just about creating more coins; it's about creating more value for its existing holders. It’s a deflationary PoW coin. Every time an asset is created on its network, a certain amount of MEWC tokens are burned – permanently removed from circulation. To date, over 2.1 million MEWC have already been burned! This deflationary mechanism is designed to create scarcity over time, which, according to basic economic principles, can make the remaining tokens more valuable. It’s a built-in feature that rewards long-term vision.\n    \n      A Low Entry Point with High Potential? The Micro-Cap Advantage!Let's talk numbers for a moment. Meowcoin currently has a very low market capitalization (around $240k according to some sources) and a low price per token (trading at fractions of a cent, like $0.00008199).  For many, this isn't a deterrent; it's an opportunity. A low market cap means there's potentially more room for significant growth compared to already large-cap coins. It offers a low entry point, meaning almost anyone can afford to get involved and be part of the journey from the ground floor. Plus, MEWC is yet to be listed on many top-tier crypto exchanges, and as we know, new exchange listings can often bring massive exposure and positively impact price. \n    \n      Active Development and a Growing Ecosystem:\n    \n      A project is only as strong as its ongoing development and vision for the future. Meowcoin isn't resting on its laurels:\n    \n      PawPrint Application: They have an active proof-of-concept application called PawPrint, which is currently under development to become production-level with more features. This signals ongoing work to build out the utility and ecosystem around MEWC.\n    \n      Scaling Tech: Early-stage exploration into scaling solutions, including potentially bigger block sizes and implementations like Taproot and Segwit, shows a forward-thinking approach to the blockchain’s future capabilities. \n    \n      Merge Mining: Dual algorithm merge mining with giants like Litecoin (LTC), Dogecoin (DOGE) and Pepecoin (PEP). This significantly boosts MEWC's network security and miner participation.\n    \n      The Power of Community:\n    \n      The Meowcoin team, including co-founder Meowmancer and developer Zach Price, emphasizes a community-first approach. Like many successful grassroots crypto projects, a passionate and engaged community is its lifeblood. This is where the real magic often happens – from spreading awareness to contributing ideas and fostering a supportive environment.\n    \n      Why Consider MEWC Now?\n    \n      If you're intrigued by a project that offers:\n    \n      A Real-World Impact: Directly contributing to animal welfare.\n    \n      Fair and Transparent Origins: No premine, no ICO. \n    \n      Potential for Growth: Due to its low market cap and deflationary tokenomics. \n    \n      Active Development: With projects like PawPrint and PawPledge\n    \n      A Passionate Community: Driving the project forward.\n    \n      Then Meowcoin (MEWC) is definitely worth putting on your research list.\n    \n      Your Next Steps: DYOR and Engage!\n    \n      This post is intended to spark your curiosity and encourage you to look deeper into Meowcoin. It's not financial advice, and as with any cryptocurrency investment, especially in the micro-cap space, Doing Your Own Research (DYOR) is absolutely paramount.\n    \n      Visit the Official Website: Head over to https://www.mewccrypto.com/ to get information straight from the source. \n    \n      Explore the Community: Check out their social channels (often listed on their site or CoinGecko/CoinMarketCap) to get a feel for the community vibe and see what others are saying.\n    \n      Understand the Risks: Micro-cap coins can be highly volatile. Understand the potential upsides and downsides before making any decisions.\n    \n      Secure Your Assets: If you do decide to invest, remember the golden rule: \"not your keys, not your crypto.\" Store your $MEWC in a non-custodial wallet where you control the private keys. \n    \n      Meowcoin presents a unique blend of meme coin energy, genuine utility through its philanthropic mission, and interesting technological propositions. It’s a project that seems to be driven by passion and a desire to make a difference, all while offering an accessible entry point for those looking to explore new opportunities in the crypto space.\n    \n      What are your thoughts on Meowcoin? Have you looked into it? Let’s discuss in the comments below!\n    \n      https://pawpledge.mewccrypto.com/\n    \n      https://coinmarketcap.com/currencies/meowcoin/\n    \n      https://www.coingecko.com/en/coins/meowcoin",
    "author": "Huge_Midnight_1535",
    "timestamp": "2025-11-15T03:54:45.308000+0000",
    "post_age": null,
    "upvotes_likes": 4,
    "comment_count": 2,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "nice work!"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1oxhrlt/with_a_price_increase_of_19750_in_the_last_7_days/",
    "post_type": "multi_media",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "MEWC",
    "raw_sentiment_score": 0.446,
    "aggregate_sentiment_score": 0.794,
    "engagement_score": 0.327
  },
  {
    "id": 10,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Imagine Buying BNB in 2017. Now With both Microsoft and Google Supporting Biokript, History Might Repeat Itself.",
    "content": "Back in 2017, a handful of early believers caught Binance before it became the giant it is today, and those early entries turned into life-changing gains.\n    \n      Today, a very similar moment is forming, and this time the project comes with something BNB never had at launch: patented technology, enterprise backing, and real trading utility.\n    \n      Biokript Pro is positioning itself as the next major player on Solana, backed by two of the world’s biggest tech companies.\n    \n      Here’s what sets it apart:\n    \n      • Patented Hybrid DEX: A full U.S. utility patent filed for decentralized anti-rug mechanisms, and automated on-chain stop-loss systems.• Google Cloud Support: Google awarded Biokript $100,000 in cloud credits to accelerate scaling and infrastructure.• First Solana DEX with rug pull protection: Real on-chain stop-loss technology designed to protect traders from sudden crashes and malicious pulls.                                   • Profit Sharing: $BIOK holders receive a share of trading fees, turning every holder into a partner.• Ultra-Low 0.1% Fees: Lower than Axiom, GMGN, and Trojan, giving traders a clear competitive advantage.\n    \n      This is not a meme coin. It’s not a fork. It’s a patented, enterprise-grade DEX built for real traders, validated by Microsoft and Google.\n    \n      The early entry window is open.\n    \n      Presale now live on Pinksale.\n    \n      Discover more at:  https://biokript.com",
    "author": "BiokriptPro",
    "timestamp": "2025-11-14T18:29:16.540000+0000",
    "post_age": null,
    "upvotes_likes": 144,
    "comment_count": 7,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "I have attended quite AMA's and events you guys were present pretty cool also doxxed so definitely got a small position based on market conditions",
      "I’ll add from your last post - this is not “supported by Microsoft”. They got in a startup hub which gives them free azure credits. Pretty low bar to entry. And does NOT mean MS have thrown their support behind it.\n    \n      Please focus on the value story, as this continuous misleading claim detracts from your story.",
      "Thanks for the feedback. Just to clarify, acceptance into Microsoft Founders Hub and Google Cloud for Startups is not a low bar and not an automatic sign up. Both companies verify that a project is a real software startup with a working product and original technology.\n    Microsoft Founders Hub checks for:\n      • Registered company• Real software product, not just an idea• Active development environment• Technical roadmap and architecture• Screening out agencies, miners, and non software projects\n    Google Cloud for Startups checks for:\n      • Registered and verifiable company• Cloud based product with real infrastructure needs• Active codebase and deployments• Proof of original technology• Screening out mining, passive income models, or non technical projects• Additional review for the 100K credit tier\n    \n      Biokript Pro met all of these requirements. The programs are not endorsements, but they do require real verification and technical qualification, and only legitimate software products get accepted. And this does not detract from our value story. It strengthens it, since both companies reviewed the technical foundation and approved it.",
      "Hi, where can te patent be found? Uspto and wipo do not know the patent number or biokript name.",
      "Hi , do you have direct proof of support? Emails, etc.",
      "This is the kind of setup you only see once in a cycle BNB had utility + timing Biokript has utility + timing + BIG tech backing Microsoft and Google + a real DeFi product That’s not hype… that’s foundation Early buyers always write the history books"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1ox4gk4/imagine_buying_bnb_in_2017_now_with_both/",
    "post_type": "multi_media",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "BIOK",
    "raw_sentiment_score": 0.689,
    "aggregate_sentiment_score": 1.0,
    "engagement_score": 0.556
  },
  {
    "id": 11,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Crypto trading communities are so scammy (but there's a solution)",
    "content": "We’ve all seen it a million times, traders predicting wild stuff like “Bitcoin to $300k in 6 months!” and then, months later, the same communities bragging with posts like “We told you to buy Solana for a 230% boost!” But how often is there any actual proof that those calls or recommendations went out at the right time? Most of the time, you just have to take their word for it. Maybe there’s a vague screenshot or someone claims “it’s all in Discord history” (good luck tracking that down). So many groups only highlight their wins or even edit history after the fact.\n    \n      Wouldn’t it be way better if every community call, trading signal, and bold prediction got properly tracked? Imagine a world where you can look up exactly who called what and when, and verify those calls later, instead of getting bombarded with cherry-picked success claims. That’s real transparency.\n    \n      This problem bugged me for months, so I decided to solve it. I built a tool that automatically logs every call or signal a community leader makes, timestamping everything for total accountability. Anyone in the community can check the history and see the real track record.\n    \n      No more fake bragging, just honest results.\n    \n      If you run a trading group, moderate a community, or are just tired of the hype with zero receipts, I’ve got a demo ready to show how this works. DM me or reply and I can walk you through it! If you have ideas or feedback about what kind of transparency features you'd find useful, let me know. Let’s change the game for crypto together.",
    "author": "itsthemegh",
    "timestamp": "2025-11-14T18:15:03.331000+0000",
    "post_age": null,
    "upvotes_likes": 0,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1ox42ij/crypto_trading_communities_are_so_scammy_but/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "BTC",
    "raw_sentiment_score": 0.563,
    "aggregate_sentiment_score": 0.737,
    "engagement_score": 0.098
  },
  {
    "id": 13,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Milkers of CryptoMoonShots, I present to you a real moonshot",
    "content": "Before you scroll, thinking this is another “shitcoin shill,” give this a quick  90 sec read.It might be the 90 sec that helps you catch a 100x gem early\n    \n      People are moving away from processed junk and synthetic lifestyles.Raw milk, farmers’ markets, cold plunges, that whole movement is blowing up.\n    \n      RAWW didn’t hop on the trend. RAWW is the trend, in meme form.\n    \n      Where most memecoins push gambling and degeneracy, RAWW is fully anti-degen, the first meme project that actually stands for something real.\n    \n      And RAWW’s narrative is unique, insanely memey, and viral.Natural lifestyle + anti-degen humor hits a massive audience.\n    \n      CA: 8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5p\n    \n      What makes RAWW stand out?\n    \n      1. The narrative is viral by default\n    \n      Natural lifestyle memes + anti-degen humor = huge mainstream meme potentialThis angle is untouched in crypto and the memcoin space\n    \n      2. The foundation is really solid\n    \n      Before any serious marketing even started, RAWW had already built:\n    \n      • RAWW Clicker Game (updated version with RAWW-based upgrades coming)• A RAWW Music Album, with 13 songs, just dropped Yesterday• Weekly RAWW Legends Webtoon chapters• Natural-fiber merch store with 10% off for RAWW holders• Telegram bot for updates, raids, airdrops• 300+ memes, skits, GIFs fully ready for rollout\n    \n      Most coins launch with nothing but vibes.RAWW launched with an ecosystem.\n    \n      Why RAWW is in prime moonshot territory\n    \n      Mcap: ~$100K right now\n    \n      The market is pricing it like a random doge copycatBut the narrative + foundation is easily Multi Mil territory once exposure kicks in\n    \n      Phase 3 just began\n    \n      The first two phases were pure building.Now comes the push:\n    \n      • Bi-weekly streams with the RAWW milk man himself on twitch, pumpfun, kick, twitter and telegram• Influencers• Daily community posting• Meme blasts• Webtoon growth• Game updates• Merch Ads\n    \n      This is the exact “pre-blowup window” that coins like Ponke + Pepe hit right before going parabolic.\n    \n      Why are you early\n    \n      Because most people on CMS won’t even read this far.But the ones who do usually catch the real moonshots.\n    \n      If a natural-lifestyle + anti-degen meme project takes off?It won’t be at a $100K mcap.\n    \n      CA: 8HqJySYJrkTqa1M4RWNBMSSnuoPRkscuLrCt3BrXjm5pLinktree: https://linktr.ee/RAWWMilkCrypto",
    "author": "Ok_Poem_2813",
    "timestamp": "2025-11-14T15:32:48.385000+0000",
    "post_age": null,
    "upvotes_likes": 15,
    "comment_count": 6,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "Only 500 holders at $100K MC. Early by the numbers.",
      "TA says we go up. vibes say we go up. cows say we go up",
      "300+ memes already out🔥",
      "RAWW is the only reason i stopped gooning",
      "Broooo😂"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owzn3q/milkers_of_cryptomoonshots_i_present_to_you_a/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "RAWW",
    "raw_sentiment_score": 0.599,
    "aggregate_sentiment_score": 0.889,
    "engagement_score": 0.449
  },
  {
    "id": 14,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Why Choose $PEP? The Path to $1–$10 Is More Realistic Than People Think 🐸",
    "content": "PEP isn’t built like a typical meme coin. It’s a full Layer-1 chain with real infrastructure, real mining, and real developers behind it, including a Dogecoin dev who joined the project because they genuinely believed in the idea and direction of the chain. That already puts PEP in a completely different category from the usual low-effort launches.\n    \n      The market cap is still extremely low for an L1 with active development, merge-mining, global marketing pushes, and growing community demand. Historically, early-stage Layer-1s with working PoW security have gone on to hit multibillion-dollar valuations during strong alt seasons. With PEP still far below that range, the upside to $1 and even pushing toward $10 isn’t some delusional moon math, it’s just what happens when liquidity finally rotates into undervalued L1 chains that actually have something built.\n    \n      PEP is merge-mined with Dogecoin and Litecoin, which gives it inherited network security from two established PoW chains. That’s a massive advantage almost no low-cap project can replicate. Add the low fees, fast transactions, and constant builder activity, and suddenly you have one of the few L1s that actually looks early rather than exhausted.\n    \n      The difference with PEP is simple: it has an active dev with real Doge history, a working chain, a low cap, and an expanding exchange presence. That combination is extremely rare in this cycle. If you’re looking for a project that isn’t just hype but has genuine room to grow into the billion-dollar range, PEP is one of the last remaining undervalued L1 plays with that kind of runway.\n    \n      Website: pepecoin.com / pepecoin.org\n    \n      Ticker: $PEP",
    "author": "Tall-Friendship3306",
    "timestamp": "2025-11-14T15:25:08.194000+0000",
    "post_age": null,
    "upvotes_likes": 69,
    "comment_count": 10,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "Only coin I've had so much faith in due to the development team!",
      "$PEP to the mooooooon",
      "How do we purchase this coin ?",
      "You can buy $PEP on MEXC, AscendEX, Biconomy, and CoinEx, with Kraken coming soon. It’s also available directly from the official site pepecoin.com/pepecoin.org ￼. Just remember the ticker $PEP, and for safety, always store your coins in a cold wallet like Coinomi or Tangem.",
      "Did you say Kraken.... I am excited about this... LFG!",
      "Or you can also mine $PEP",
      "How do you mine $pep?",
      "pepecoin.org",
      "Let’s goo"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owzfnv/why_choose_pep_the_path_to_110_is_more_realistic/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "PEP",
    "raw_sentiment_score": 0.684,
    "aggregate_sentiment_score": 1.0,
    "engagement_score": 0.535
  },
  {
    "id": 15,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "KTA - who's excited, who's not?",
    "content": "Before you slate me here, I have used chatGPT to tidy my thoughts and also verify what I'm saying to be correct. I want to gauge the general sentiment around Keeta Network's KTA token, the blockchain itself, and the potential for growth and scale, as for me, it seems like a very exciting later 1.\n    \n      So my question is, who's in on this? Who's not? What are your general thoughts and opinions?\n    \n      Now here's the chatgpt copy paste, some info re what Keeta is, it's use cases, what they've done this far, what's included in the roadmap, and why it might see exponential growth in parallel with Google's GCUL. (If you're already familiar, read no further).\n    \n      📌 What Keeta Network Is\n    \n      A high-throughput Layer-1 built for payments + RWAs Aims for ~10M TPS and sub-second finality so banks, card networks, and other chains can realistically use it as settlement infrastructure.\n    \n      Compliance-first design (KYC/AML native) Uses certificates/anchors so regulated institutions can enforce KYC/AML on-chain. Basically built to be “usable by banks,” not just DeFi.\n    \n      Interoperability through Anchors Anchors connect Keeta to other blockchains (ETH, Base, Solana, etc.) and to traditional payment rails. This is how stablecoins and RWAs move across networks without classic bridges.\n    \n      Built around stablecoins + tokenized real-world assets KUSD (their USD stablecoin) is a first-class asset on the network, designed for regulated money movement.\n    \n      Backed by Eric Schmidt (ex-Google CEO) Schmidt led a $17M round into Keeta. Big signal boost toward the “serious infra” narrative.\n    \n      📌 What They’ve Done So Far\n    \n      Funding + multi-year infra build Ledger, consensus, compliance framework, KYC system, Anchors, wallet, explorer.\n    \n      Testnets + identity layer Public testnets + PASS (on-chain credit identity) launched with SOLO, aimed at letting users carry financial identity into lending/credit.\n    \n      Mainnet launch (Sept 2025) KeetaNet went live with staking, governance, and real value transfer.\n    \n      KTA token launch (Spring 2025) Native gas + governance token.\n    \n      Coinbase listing (Oct 2025) KTA launched on Base, then got a full Coinbase listing, giving it major access and liquidity.\n    \n      Google Cloud case study Highlighted Keeta’s 10M+ TPS capability using Google Spanner, reinforcing the “enterprise-grade settlement network” pitch.\n    \n      📌 The Stablecoin Angle (KUSD)\n    \n      Fully compliant USD stablecoin built on Keeta.\n    \n      Moves across chains via Anchors without bridge risk.\n    \n      Intended to be the default settlement asset for payments, RWAs, and cross-chain flows.\n    \n      📌 Roadmap: Next ~6 Months\n    \n        \n      \n      Fiat Anchors (on/off ramps)\n    \n    \n      \n      Bank → Keeta → Bank flows via ACH/SEPA.\n    \n      Deposits turn into KUSD/KTA; withdrawals convert back to fiat.\n    \n      This is the biggest Q4/Q1 milestone.\n    \n      2. Keeta Card (debit/credit rails)\n    \n      Card linked to KUSD balance.\n    \n      Real-time payments settled over Keeta.\n    \n      Expect pilot programs & partner announcements.\n    \n      3. Keeta Pay (non-custodial payment app)\n    \n      Banking-style app UX.\n    \n      Expect beta/waitlist + PASS integration updates.\n    \n      4. DEX + DeFi plumbing\n    \n      High-frequency DEX using Keeta’s TPS.\n    \n      Likely early test version in Q1 2026.\n    \n      5. Governance + audits + public repos\n    \n      More code visibility, audits, and clarity on staking/vesting.\n    \n      6. PASS credit expansion\n    \n      Deeper integrations with lenders using Keeta’s identity layer.\n    \n      Supports the roadmap for credit cards, loans, and RWA financing.\n    \n      📌 How Keeta Could Interact With Google’s GCUL Project\n    \n      GCUL (Google’s Global Cross-Cloud Unified Ledger) is Google’s initiative to create a unified global financial settlement layer across banks, cloud environments, and payment services.\n    \n      It’s explicitly built around:\n    \n      high-throughput infrastructure\n    \n      regulatory compliance\n    \n      interoperability between financial networks\n    \n      real-time settlement of fiat + digital assets\n    \n      Keeta’s architecture aligns directly with the features GCUL aims to unify:\n    \n      High transaction throughput (multi-million TPS range)\n    \n      Compliance-first design with identity enforcement\n    \n      Interoperability across chains and real-world banking rails\n    \n      Fiat-backed asset movement (KUSD and Anchors)\n    \n      This doesn’t mean Keeta is officially part of GCUL — it means Keeta is engineered in the exact direction needed to be compatible with GCUL-like systems.\n    \n      If GCUL becomes widely adopted, networks that support regulated, high-speed settlement and identity verification will be first in line for integration. Keeta is one of the few L1s built with this design philosophy from day one.\n    \n      📌 Eric Schmidt’s Involvement Matters More Now\n    \n      Eric Schmidt’s investment isn’t just a name drop. It has meaningful implications:\n    \n      Schmidt was CEO of Google during the creation of the infrastructure that GCUL relies on (Spanner, Borg systems, distributed consensus frameworks).\n    \n      Keeta’s architecture is explicitly built on similar principles (horizontal scaling, global synchronization, cloud-native consensus).\n    \n      Schmidt’s presence signals:\n    \n      credibility within Google/enterprise circles\n    \n      alignment with how GCUL and large-scale settlement networks work\n    \n      potential future compatibility or collaboration paths\n    \n      TL;DR\n    \n      Keeta is positioning itself as a regulatory-friendly, high-throughput settlement layer for stablecoins, RWAs, and traditional payments—with Eric Schmidt backing, a live mainnet, a Coinbase-listed token, and a roadmap full of fiat ramps, a stablecoin system, and card/payments integrations.",
    "author": "CoinMongerer",
    "timestamp": "2025-11-14T15:01:24.097000+0000",
    "post_age": null,
    "upvotes_likes": 2,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owyspn/kta_whos_excited_whos_not/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "KTA",
    "raw_sentiment_score": 0.689,
    "aggregate_sentiment_score": 0.884,
    "engagement_score": 0.251
  },
  {
    "id": 16,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "How I’m Rotating Meme Coins Without Losing My Mind",
    "content": "The market situation currently has been chaotic, more losses than wins and its draining but lately, I’ve found a way to make it feel productive despite the losses. I joined Onchain Challenge on Bitget, 27 phases in  and it’s giving me a daily rhythm I didn’t have before.\n    \n      Instead of blindly chasing every hype coin. I rotate through From Memes to Onchain Stocks, ($KOGE, $USELESS, $TSLAon, $DISon, $ASTER, and $MET,) focusing on tokens with real momentum and active communities.\n    \n      The biggest shift for me wasn’t luck, it was treating trading like a routine. Each small trade adds up, and I can actually see consistent progress building over time. I’ve started stacking rewards steadily, without putting everything on one moonshot. It’s a small-scale approach, but it keeps me grounded while still participating in meme chaos.\n    \n      The rewards are nice, but what really matters is discipline. This Phases grind reminds me that even in a hype-driven market, structure and consistency can turn chaos into tangible results.\n    \n      What has been working for you guys in this chaotic market?",
    "author": "ConsiderationFit2353",
    "timestamp": "2025-11-14T15:00:10.766000+0000",
    "post_age": null,
    "upvotes_likes": 2,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owyrcm/how_im_rotating_meme_coins_without_losing_my_mind/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "KOGE",
    "raw_sentiment_score": 0.516,
    "aggregate_sentiment_score": 0.766,
    "engagement_score": 0.251
  },
  {
    "id": 17,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Why I won’t touch a Crypto Presale without liquidity-lock proof",
    "content": "I’ve been burned before. Hype was perfect, roadmap looked clean… then the pool got drained. Since then, my rule is simple: no liquidity lock, no ticket. A locked pool makes it way harder to execute a classic rug (dev yanks LP, price goes to zero). It’s not bulletproof, but it’s the first filter for any crypto presale I touch.\n    \n      Here’s my 60-second checklist for any presale crypto pitch claiming to be among the best crypto presales:\n    \n        \n      \n      Public LP lock (timelock or reputable locker). Screenshots aren’t enough—verify the contract + duration. Burning LP ≠ locking; burning can still be gamed, locking is auditable.\n    \n    \n      \n      Real liquidity depth. A “100% locked” pool with tiny USD value is theater. Size matters more than the percentage.\n    \n    \n      \n      Team & token vesting. Time-locked team tokens reduce dump risk post-launch.\n    \n    \n      \n      DEX mechanics sanity check. If LP tokens can be burned to withdraw reserves, you need proof those LP tokens are locked away from the team.\n    \n    \n      \n      Why I’m strict: billions were lost to rugs and Ponzi-style schemes last year, and liquidity pulls remain a primary vector. If a project can’t lock, I assume they won’t.\n    \n      One new crypto presale that passed my first filter: Digitap Presale ($TAP Presale). I like the simplicity, clear value prop, and the emphasis on transparency. Not saying it’s the best crypto presale or your golden ticket—just that it checks the boxes I require before I even think about how to buy presale crypto or adding it to my crypto presale list.\n    \n      Your turn: What presale crypto coins surprised you—either a moon or a faceplant—and did liquidity-lock proof factor into your call? I’m compiling the best crypto presales 2025 watchlist and want real takes, not bots.",
    "author": "fishyplayer",
    "timestamp": "2025-11-14T12:48:31.626000+0000",
    "post_age": null,
    "upvotes_likes": 1,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owvlkk/why_i_wont_touch_a_crypto_presale_without/",
    "post_type": "multi_media",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "TAP",
    "raw_sentiment_score": 0.64,
    "aggregate_sentiment_score": 0.829,
    "engagement_score": 0.202
  },
  {
    "id": 18,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Obey The Void ($OBEY) – El Vacío sigue expandiéndose: retrospectiva, logros y próxima charla del dev",
    "content": "Durante los últimos días, la comunidad detrás de Obey The Void ($OBEY) ha mostrado una fuerza inusual dentro del panorama Solana, atravesando momentos críticos y consolidando logros en plena turbulencia del mercado.\n    \n      **Logros recientes destacados:**\n    \n      - **24.3% del suministro bloqueado**: En plena volatilidad del sector, OBEY ha alcanzado el hito de bloquear casi una cuarta parte de su supply, lo que aporta confianza y solidez a largo plazo entre holders y participantes.\n    \n      - **Resistencia de precio**: Mientras otros proyectos se ven afectados por la caída global, OBEY ha sostenido su \"floor\" en los 100k, mostrando estabilidad y capacidad de resiliencia.\n    \n      - **Recompensas diarias por participación**: Los X-raids y actividades en Telegram y Reddit permiten ganar tokens cada día, reforzando la utilidad activa y la gamificación dentro del ecosistema.\n    \n      - **Lore único y cultos organizados**: El proyecto no es solo un meme; su narrativa del \"VOID\" y los cultos como Messengers y Puggle han generado una comunidad cohesionada, creativa y con identidad propia.\n    \n      - **Éxito en votos y presencia cross-platform**: La comunidad ha organizado raids de votos y comentarios que han posicionado a OBEY en plataformas como Capitoday y tracking sites relevantes.\n    \n      **Consulta los gráficos y análisis de precio de OBEY:**\n    \n      - [CoinMarketCap – Obey The Void](https://coinmarketcap.com/currencies/void/)\n    \n      - [Capitoday – OBEY info](https://capitoday.com/meme/obey-the-void)\n    \n      **Próxima charla importante:**\n    \n      El desarrollador principal de Obey The Void dará una charla exclusiva el **sábado 15 de noviembre a las 20:00** (CET) en el grupo de [Telegram oficial](https://web.telegram.org/k/#@ObeyTheVoid). Será una oportunidad clave para conocer de primera mano los próximos objetivos y aclarar dudas técnicas o de comunidad.\n    \n      ---\n    \n      **OBEY está en pleno ciclo de expansión y consolidación**, con hitos verificables, comunidad activa y lore original. Si quieres participar, ganar recompensas y entender la narrativa completa, únete al grupo y mantente atento a la charla del dev.\n    \n      *¿Tienes preguntas específicas? Deja tu comentario aquí o acude a la sesión en Telegram. El vacío está aquí, y la expansión es imparable.*",
    "author": "newfromspain",
    "timestamp": "2025-11-14T10:32:14.489000+0000",
    "post_age": null,
    "upvotes_likes": 4,
    "comment_count": 2,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "Sepan ustedes que, por algún motivo que desconozco,  no estoy viendo los comentarios. Si tienen alguna pregunta, envíenme mensaje directo."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owt0sm/obey_the_void_obey_el_vacío_sigue_expandiéndose/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "OBEY",
    "raw_sentiment_score": 0.589,
    "aggregate_sentiment_score": 0.827,
    "engagement_score": 0.327
  },
  {
    "id": 19,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Crypto Coin \"SWELL\"",
    "content": "I'm always on the look out for cheap Cryptos with high probability of going up in the future and also was up in the past. Right now SWELL is still at a low buying price so my advice is to invest before the price jumps up. If you're new to the how to buy/sell crypto coin game, I would suggest using the coinbase app.  They do have fees for buying and selling but worth it in my opinion in the grand scheme of things.  They do have graphs and other useful information as well. Here is some info about SWELL if your interested:\n    \n      https://www.swellnetwork.io/\n    \n      Swell's mission is to deliver the world's best liquid staking and restaking experience, simplify access to DeFi, and secure the future of the Ethereum network\n    \n      . Swell Network is a non-custodial protocol that allows users to stake ETH and receive liquid tokens (swETH) that can be used across the DeFi ecosystem. \n    \n      Core components of Swell's mission\n    \n        \n      \n      Democratize access to staking: Swell aims to make staking ETH accessible to everyone, regardless of the amount of ETH they hold or their technical expertise. Traditional staking on Ethereum typically requires users to lock up 32 ETH and have specific technical knowledge to run a validator.\n    \n    \n      \n      Provide a high-quality user experience: The protocol strives to overcome the complexity and poor user experience often found in DeFi. It focuses on creating a simple and easy liquid staking process for all users.\n    \n    \n      \n      Embrace decentralization and innovation: Swell is built on core values of decentralization and innovation. It uses new technologies, such as Distributed Validator Technology (DVT) and restaking protocols like EigenLayer, to enhance the security and integrity of the Ethereum network.\n    \n    \n      \n      Strengthen community governance: The Swell Network is governed by the Swell Decentralized Autonomous Organization (DAO), which is run by holders of the SWELL token. This allows the community to participate in major decisions, ensuring the protocol aligns with the collective interests of its members.\n    \n    \n      \n      Uphold a security-first approach: Recognizing the inherent risks in DeFi, Swell prioritizes security. The protocol undergoes regular smart contract audits, offers bug bounty programs, and uses reputable node operators to protect user assets and the network.",
    "author": "Mammoth-Eye-2173",
    "timestamp": "2025-11-14T06:02:37.828000+0000",
    "post_age": null,
    "upvotes_likes": 1,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owopxe/crypto_coin_swell/",
    "post_type": "multi_media",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "SWELL",
    "raw_sentiment_score": 0.569,
    "aggregate_sentiment_score": 0.78,
    "engagement_score": 0.202
  },
  {
    "id": 20,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Grass is an AI + DePIN project on Solana that lets you earn crypto passively by sharing your unused bandwidth; literally make money while you sleep",
    "content": "Grass is an AI + DePIN project on Solana that lets you earn crypto passively by sharing your unused bandwidth — literally make money while you sleep\n    \n      🔥 Why People Are Watching Grass: • AI x DePIN Fusion: Power AI networks by contributing bandwidth — get paid in crypto. • Early Mover Advantage: Still early; could become key AI infrastructure. • Truly Passive Income: Install it, run it, forget it. No mining, no tasks. • Bonus: Use SEsneMoIYQS6M3w at signup for 5,000 extra points. • Built on Solana: Fast, scalable, and low-fee — ideal for DePIN growth.\n    \n      🛠️ How to Start (2 mins):\n    \n        \n      \n      Register → Grass Sign-Up: https://app.grass.io/register?referralCode=SEsneMoIYQS6M3w\n    \n    \n      \n      Install the app (desktop or Android)\n    \n    \n      \n      Let it run in the background — start earning\n    \n    \n      \n      🌐 Learn More: • CoinMarketCap: https://coinmarketcap.com/currencies/grass/\n    \n      Make your internet connection work for you. Join the AI x DePIN movement with Grass — real utility, real passive income.\n    \n      📈 Recent Stats (2025): • 8.3M active users (last 30 days) • 1M+ concurrent connections • 3PB data retrieved daily from customer demand\n    \n      Grass is the next big thing that combines AI and Depin within the blockchain world",
    "author": "Maleficent-Will7614",
    "timestamp": "2025-11-13T23:38:52.004000+0000",
    "post_age": null,
    "upvotes_likes": 2,
    "comment_count": 2,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
      "I have a feeling the second phase of grass would cook hard, was eligible for the first hoping to see the second soon"
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owgrqp/grass_is_an_ai_depin_project_on_solana_that_lets/",
    "post_type": "multi_media",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "GRASS",
    "raw_sentiment_score": 0.568,
    "aggregate_sentiment_score": 0.75,
    "engagement_score": 0.278
  },
  {
    "id": 22,
    "source": "r/CryptoMoonShots",
    "platform": "reddit",
    "title": "Celebrate this Holiday Season with Santa Paws | Trusted, Known, Proven and Experienced Core Team",
    "content": "Welcome to Santa Paws   The Christmas moonshot we’ve all been waiting for!\n    \n      This festive season, Santa Paws ($PAWS) is bringing holiday magic straight to Solana — with prizes, community fun, and massive upside potential!\n    \n      And here’s the best part the Santa Paws Advent Calendar is live soon, with over $2,500 worth of prizes ready to be unwrapped all month long!\n    \n      Remember: to qualify for the Advent Calendar prizes, you must hold at least 100k $PAWS tokens, which is also the minimum buy to join the fun.\n    \n      What is Santa Paws?\n    \n      Santa Paws isn’t just another memecoin — it’s a holiday movement for the people, by the people. Built on Solana, this project combines the excitement of Christmas with the energy of the meme community to create something purely magical.\n    \n      Presale completed successfully: 78.02 SOL raised from 57 contributors on WenPad\n    \n      Liquidity locked — ensuring safety and long-term sustainability\n    \n      KYC verified & team DOXXED — full transparency and trust\n    \n      Advent Calendar Giveaway: Over $2,500 in prizes exclusively for holders\n    \n      Why Join Santa Paws?\n    \n      The Santa Paws team is trusted, known, proven, and experienced — not a fly-by-night meme play. The core devs and marketers are veterans in the Solana space, fully equipped to push $PAWS to the moon and beyond this holiday season.\n    \n      From community contests and daily giveaways to meme competitions and festive surprises, this isn’t just a token  it’s a holiday experience wrapped in Solana speed.\n    \n      The Spirit of Giving\n    \n      Santa Paws is all about spreading cheer and rewards. Whether you’re a degen trader, a meme lover, or just someone looking for some Christmas fun on-chain — there’s a place for you here.\n    \n      Holders can look forward to exclusive rewards, community airdrops, and Santa’s secret gifts throughout the season.\n    \n      Be early, not late — don’t let the first candles run without you.Join the community, grab your $PAWS, and get ready to open your advent doors to the moon!\n    \n      Happy Holidays from the Santa Paws Team!\n    \n      Twitter: https://x.com/Santa_Paws_SolTG: SantapawssolanaCA: PaWs8MJwahoofHewZCCRTRwrvWS89Lhnm1NwmeDMQ1V\n    \n      Minimum Buy: 100K $PAWS to qualify for Advent Prizes",
    "author": "No_Dust_3152",
    "timestamp": "2025-11-13T20:25:34.937000+0000",
    "post_age": null,
    "upvotes_likes": 506,
    "comment_count": 1,
    "award_count": 0,
    "comments": [
      "Moderator Announcement\n          Read More »\n        \n    \n  \n          \n      \n      ⚠️ Don't forget to do your due diligence! Use Rick on Telegram to scan tokens and identify any potential security threats.\n    \n      I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."
    ],
    "link": "https://www.reddit.com/r/CryptoMoonShots/comments/1owby7x/celebrate_this_holiday_season_with_santa_paws/",
    "post_type": "text",
    "sentiment_score": null,
    "hype_score": null,
    "token_name": "PAWS",
    "raw_sentiment_score": 0.892,
    "aggregate_sentiment_score": 1.0,
    "engagement_score": 0.57
  }
]